defineCode = [
    {
        "name": "適用入學年度",
        "len": 3
    },
    {
        "name": "校代碼",
        "len": 6
    },
    {
        "name": "課程類型",
        "len": 1
    },
    {
        "name": "群別代碼",
        "len": 2
    },
    {
        "name": "科別代碼",
        "len": 3
    },
    {
        "name": "班群",
        "len": 1
    },
    {
        "name": "課程類別",
        "len": 1
    },
    {
        "name": "開課方式",
        "len": 1
    },
    {
        "name": "科目屬性",
        "len": 1
    },
    {
        "name": "領域名稱",
        "len": 2
    },
    {
        "name": "科目名稱代碼",
        "len": 2
    }
]
schoolMap = {
    "010301": "國立華僑高級中等學校",
    "010F01": "新北市立新北特殊教育學校",
    "011301": "中華中學學校財團法人新北市中華高級中學",
    "011302": "天主教光仁學校財團法人新北市光仁高級中學",
    "011303": "天主教崇光學校財團法人新北市崇光女子高級中學",
    "011304": "東海中學學校財團法人新北市東海高級中學",
    "011305": "金陵學校財團法人新北市金陵女子高級中學",
    "011306": "南山學校財團法人新北市南山高級中學",
    "011307": "剛恆毅學校財團法人新北市天主教恆毅高級中學",
    "011308": "時雨學校財團法人新北市私立時雨高級中學",
    "011309": "崇義學校財團法人新北市崇義高級中學",
    "011310": "康橋學校財團法人新北市康橋高級中學",
    "011311": "新北市私立及人高級中學",
    "011312": "新北市私立竹林高級中學",
    "011313": "新北市私立徐匯高級中學",
    "011314": "新北市私立淡江高級中學",
    "011315": "新北市私立聖心女子高級中學",
    "011316": "新北市私立醒吾高級中學",
    "011317": "裕德學校財團法人新北市裕德高級中等學校",
    "011318": "鄭義燕學校財團法人新北市私立格致高級中等學校",
    "011319": "辭修學校財團法人新北市私立辭修高級中學",
    "011401": "能仁學校財團法人新北市能仁高級家事商業職業學校",
    "011402": "清傳學校財團法人新北市清傳高級商業職業學校",
    "011403": "智光學校財團法人新北市智光高級商工職業學校",
    "011404": "新北市私立中華商業海事職業學校",
    "011405": "新北市私立南強高級工商職業學校",
    "011406": "新北市私立莊敬高級工業家事職業學校",
    "011407": "新北市私立復興高級商工職業學校",
    "011408": "新北市私立開明高級工業商業職業學校",
    "011409": "新北市私立樹人高級家事商業職業學校",
    "011410": "新北市私立豫章高級工商職業學校",
    "011411": "穀保學校財團法人新北市穀保高級家事商業職業學校",
    "011C01": "新北市私立光華高級商業職業進修學校",
    "013301": "新北市立三民高級中學",
    "013302": "新北市立三重高級中學",
    "013303": "新北市立中和高級中學",
    "013304": "新北市立丹鳳高級中學",
    "013305": "新北市立北大高級中學",
    "013306": "新北市立永平高級中學",
    "013307": "新北市立石碇高級中學",
    "013308": "新北市立光復高級中學",
    "013309": "新北市立安康高級中學",
    "013310": "新北市立竹圍高級中學",
    "013311": "新北市立秀峰高級中學",
    "013312": "新北市立明德高級中學",
    "013313": "新北市立板橋高級中學",
    "013314": "新北市立林口高級中學",
    "013315": "新北市立金山高級中學",
    "013316": "新北市立泰山高級中學",
    "013317": "新北市立海山高級中學",
    "013318": "新北市立清水高級中學",
    "013319": "新北市立新北高級中學",
    "013320": "新北市立新店高級中學",
    "013321": "新北市立新莊高級中學",
    "013322": "新北市立樟樹國際實創高級中等學校",
    "013323": "新北市立樹林高級中學",
    "013324": "新北市立錦和高級中學",
    "013325": "新北市立雙溪高級中學",
    "013401": "新北市立三重高級商工職業學校",
    "013402": "新北市立淡水高級商工職業學校",
    "013403": "新北市立新北高級工業職業學校",
    "013404": "新北市立瑞芳高級工業職業學校",
    "013405": "新北市立鶯歌高級工商職業學校",
    "020301": "國立蘭陽女子高級中學",
    "020302": "國立宜蘭高級中學",
    "020308": "國立羅東高級中學",
    "020403": "國立宜蘭高級商業職業學校",
    "020404": "國立羅東高級商業職業學校",
    "020405": "國立蘇澳高級海事水產職業學校",
    "020407": "國立羅東高級工業職業學校",
    "020409": "國立頭城高級家事商業職業學校",
    "020C01": "國立宜蘭大學附設高級農工職業進修學校",
    "020C02": "國立宜蘭高級商業職業學校附設進修學校",
    "020C03": "國立頭城高級家事商業職業學校附設進修學校",
    "020C04": "國立羅東高級工業職業學校附設進修學校",
    "020C05": "國立羅東高級商業職業學校附設進修學校",
    "020C06": "國立蘇澳高級海事水產職業學校附設進修學校",
    "020F01": "國立宜蘭特殊教育學校",
    "021301": "宜蘭縣私立慧燈高級中學",
    "021310": "中道學校財團法人宜蘭縣中道高級中學",
    "024322": "宜蘭縣立南澳高級中學",
    "024323": "宜蘭縣立慈心華德福教育實驗高級中等學校",
    "030304": "桃園市立桃園高級中等學校",
    "030305": "國立中央大學附屬中壢高級中學",
    "030306": "桃園市立武陵高級中等學校",
    "030316": "桃園市立楊梅高級中等學校",
    "030325": "桃園市立陽明高級中等學校",
    "030327": "桃園市立內壢高級中等學校",
    "030402": "桃園市立龍潭高級中等學校",
    "030403": "國立臺北科技大學附屬桃園農工高級中等學校",
    "030407": "桃園市立中壢商業高級中等學校",
    "030408": "桃園市立中壢家事商業高級中等學校",
    "030B01": "國立龍潭高級中學附設進修學校",
    "030C01": "國立中壢高級家事商業職業學校附設進修學校",
    "030C02": "國立中壢高級商業職業學校附設進修學校",
    "030C03": "國立桃園高級農工職業學校附設進修學校",
    "030C04": "國立臺北科技大學附屬桃園農工高級中等學校附設進修學校分校",
    "030F01": "國立桃園啟智學校",
    "031301": "泉僑學校財團法人桃園市漢英高級中等學校",
    "031309": "桃園育達學校財團法人桃園市育達高級中等學校",
    "031310": "六和學校財團法人桃園市六和高級中等學校",
    "031311": "復旦學校財團法人桃園市復旦高級中等學校",
    "031312": "治平學校財團法人桃園市治平高級中等學校",
    "031313": "天主教振聲學校財團法人桃園市振聲高級中等學校",
    "031317": "光啟學校財團法人桃園市光啟高級中等學校",
    "031318": "啟英學校財團法人桃園市啟英高級中等學校",
    "031319": "清華學校財團法人桃園市清華高級中等學校",
    "031320": "新興學校財團法人桃園市新興高級中等學校",
    "031323": "桃園市至善高級中學",
    "031324": "大興學校財團法人桃園市大興高級中等學校",
    "031326": "臺灣大華學校財團法人桃園市私立大華高級中等學校",
    "031414": "桃園市私立成功高級工商職業學校",
    "031415": "桃園市私立方曙高級商工職業學校",
    "031421": "永平學校財團法人桃園市私立永平工商高級中等學校",
    "031B01": "光啟學校財團法人桃園市光啟高級中學附設進修部",
    "031B02": "桃園市大興高級中學附設進修部",
    "031B03": "桃園市私立治平高級中學附設進修學校",
    "031B04": "桃園市私立振聲高級中學附設進修學校",
    "031B05": "桃園市私立啟英高級中學附設進修學校",
    "031B06": "桃園市私立復旦高級中學附設進修學校",
    "031B07": "桃園市育達高級中學附設進修學校",
    "031B08": "桃園市清華高級中學附設進修學校",
    "031B09": "新興學校財團法人桃園市新興高級中學附設進修學校",
    "031B10": "私立宏德高級進修學校",
    "031C02": "桃園市私立永平高級工商職業學校附設進修學校",
    "031C03": "桃園市私立成功高級工商職業學校附設進修部",
    "031C04": "桃園市私立方曙高級商工職業學校附設進修學校",
    "033301": "桃園市立觀音高級中等學校",
    "033302": "桃園市立壽山高級中等學校",
    "033303": "桃園市立大園國際高級中等學校",
    "033304": "桃園市立大溪高級中等學校",
    "033305": "桃園市立新屋高級中等學校",
    "033F01": "桃園市立桃園特殊教育學校",
    "034306": "桃園市立南崁高級中等學校",
    "034319": "桃園市立平鎮高級中等學校",
    "034347": "桃園市立永豐高級中等學校",
    "040302": "國立竹東高級中學",
    "040304": "國立關西高級中學",
    "040308": "國立竹北高級中學",
    "040B01": "國立竹東高級中學附設進修學校",
    "040F01": "國立新竹特殊教育學校",
    "041303": "新竹縣私立義民高級中學",
    "041305": "新竹縣私立忠信高級中學",
    "041306": "臺灣省新竹縣私立東泰高級中學",
    "041307": "新竹縣仰德高級中學",
    "041401": "新竹縣私立內思高級工業職業學校",
    "041B02": "新竹縣私立忠信高級中學附設進修學校",
    "041B03": "新竹縣私立東泰高級中學附設進修學校",
    "041B04": "新竹縣私立義民高級中學附設進修學校",
    "041C01": "新竹縣私立內思高級工業職業學校附設進修學校",
    "044301": "新竹縣立六家高級中學",
    "044320": "新竹縣立湖口高級中學",
    "050303": "國立苗栗高級中學",
    "050310": "國立竹南高級中學",
    "050314": "國立卓蘭高級中等學校",
    "050315": "國立苑裡高級中學",
    "050401": "國立大湖高級農工職業學校",
    "050404": "國立苗栗高級農工職業學校",
    "050407": "國立苗栗高級商業職業學校",
    "050B01": "國立卓蘭實驗高級中學附設進修學校",
    "050C01": "國立苗栗高級商業職業學校附設進修學校",
    "050F01": "國立苗栗特殊教育學校",
    "051302": "苗栗縣私立君毅高級中學",
    "051305": "苗栗縣私立大成高級中學",
    "051306": "苗栗縣私立建臺高級中學",
    "051307": "全人學校財團法人苗栗縣全人實驗高級中學",
    "051408": "苗栗縣私立中興高級商工職業學校",
    "051411": "苗栗縣私立育民高級工業家事職業學校",
    "051412": "苗栗縣私立賢德高級工商職業學校",
    "051413": "苗栗縣私立龍德家事商業職業學校",
    "051B01": "苗栗縣私立大成高級中學附設進修學校",
    "051B02": "苗栗縣私立君毅高級中學附設進修學校",
    "051B03": "苗栗縣私立建臺高級中學附設進修學校",
    "051C01": "苗栗縣私立中興高級商工職業學校附設進修學校",
    "051C02": "苗栗縣私立育民高級工業家事職業學校附設進修學校",
    "054309": "苗栗縣立苑裡高級中學",
    "054317": "苗栗縣立興華高級中學",
    "054318": "苗栗縣立三義高級中學",
    "054319": "苗栗縣立大同高級中學",
    "060303": "臺中市立大甲高級中等學校",
    "060305": "臺中市立清水高級中等學校",
    "060312": "臺中市立豐原高級中等學校",
    "060322": "國立中興大學附屬高級中學",
    "060323": "國立中科實驗高級中學",
    "060401": "臺中市立豐原商業高級中等學校",
    "060402": "臺中市立大甲工業高級中等學校",
    "060404": "臺中市立東勢工業高級中等學校",
    "060407": "臺中市立沙鹿工業高級中等學校",
    "060408": "臺中市立霧峰農業工業高級中等學校",
    "060C04": "國立東勢高級工業職業學校附設進修學校",
    "060C07": "國立沙鹿高級工業職業學校附設進修學校",
    "060C08": "國立霧峰高級農工職業學校附設進修學校",
    "060C20": "國立台中啟明學校附設高商進修學校",
    "060F01": "臺中市立啟明學校",
    "061301": "常春藤學校財團法人臺中市常春藤高級中學",
    "061306": "臺中市明台高級中學",
    "061309": "臺中市私立致用高級中學",
    "061310": "臺中市私立大明高級中學",
    "061311": "嘉陽學校財團法人臺中市嘉陽高級中學",
    "061313": "臺中市私立明道高級中學",
    "061314": "臺中市私立僑泰高級中學",
    "061315": "臺中市華盛頓高級中學",
    "061316": "臺中市青年高級中學",
    "061317": "臺中市私立弘文高級中學",
    "061318": "臺中市私立立人高級中學",
    "061319": "臺中市私立玉山高級中學",
    "061321": "臺中市私立慈明高級中學",
    "061601": "東海大學附屬實驗高級中學小學部",
    "061B06": "臺中市私立明台高級中學進修學校",
    "061B10": "臺中市私立大明高級中學進修學校",
    "061B11": "私立嘉陽高級中學進修學校",
    "061B13": "臺中市私立明道高級中學進修學校",
    "061B14": "私立僑泰高級中學進修學校",
    "061B16": "臺中市私立青年高級中學進修學校",
    "061B19": "臺中市私立玉山高級中學進修學校",
    "061B21": "私立慈明高級中學進修學校",
    "061F01": "臺中市私立惠明學校",
    "064308": "臺中市立后綜高級中學",
    "064324": "臺中市立大里高級中學",
    "064328": "臺中市立新社高級中學",
    "064336": "臺中市立長億高級中學",
    "064342": "臺中市立中港高級中學",
    "070301": "國立彰化女子高級中學",
    "070304": "國立員林高級中學",
    "070307": "國立彰化高級中學",
    "070316": "國立鹿港高級中學",
    "070319": "國立溪湖高級中學",
    "070401": "國立彰化師範大學附屬高級工業職業學校",
    "070402": "國立永靖高級工業職業學校",
    "070403": "國立二林高級工商職業學校",
    "070405": "國立秀水高級工業職業學校",
    "070406": "國立彰化高級商業職業學校",
    "070408": "國立員林高級農工職業學校",
    "070409": "國立員林崇實高級工業職業學校",
    "070410": "國立員林高級家事商業職業學校",
    "070415": "國立北斗高級家事商業職業學校",
    "070B16": "國立鹿港高級中學進修學校",
    "070C01": "國立彰化師大附工進修學校",
    "070C02": "國立永靖高級工業職業學校附設進修學校",
    "070C03": "國立二林高級工商職業學校附設進修學校分校",
    "070C05": "國立秀水高級工業職業進修學校",
    "070C06": "國立彰化高級商業職業進修學校",
    "070C08": "國立員林高級農工職業進修學校",
    "070C09": "國立員林崇實高級工業職業進修學校",
    "070C10": "國立員林高級家事商業職業進修學校",
    "070C15": "國立北斗高級家事商業職業進修部",
    "070F01": "國立和美實驗學校",
    "070F02": "國立彰化特殊教育學校",
    "071311": "彰化縣私立精誠高級中學",
    "071317": "彰化縣私立文興高級中學",
    "071318": "正德學校財團法人彰化縣正德高級中學",
    "071413": "彰化縣私立大慶高級商工職業學校",
    "071414": "彰化縣私立達德高級商工職業學校",
    "071B18": "正德學校財團法人彰化縣正德高級中學附設進修學校",
    "071C13": "彰化縣私立大慶高級商工職業學校附設進修學校",
    "071C14": "私立達德高級商工職業進修學校",
    "074308": "彰化縣立彰化藝術高級中學",
    "074313": "彰化縣立二林高級中學",
    "074314": "彰化縣立田中高級中學",
    "074315": "彰化縣立成功高級中學",
    "074316": "彰化縣立和美高級中學",
    "080302": "國立南投高級中學",
    "080305": "國立中興高級中學",
    "080307": "國立竹山高級中學",
    "080308": "國立暨南國際大學附屬高級中學",
    "080401": "國立仁愛高級農業職業學校",
    "080403": "國立埔里高級工業職業學校",
    "080404": "國立南投高級商業職業學校",
    "080406": "國立草屯高級商工職業學校",
    "080410": "國立水里高級商工職業學校",
    "080B05": "國立中興高中進修學校",
    "080B07": "國立竹山高中進修學校",
    "080B08": "國立暨大附中進修學校",
    "080C04": "國立南投高商進修學校",
    "080C10": "國立水里商工進修學校",
    "080F01": "國立南投特殊教育學校",
    "081311": "南投縣私立五育高級中學",
    "081312": "南投縣私立三育高級中學",
    "081313": "南投縣私立弘明實驗高級中學",
    "081314": "南投縣私立普台高級中學",
    "081409": "同德學校財團法人南投縣同德高級中等學校",
    "081C09": "同德學校財團法人南投縣同德高級中等學校附設進修部",
    "084309": "南投縣立旭光高級中學",
    "090305": "國立斗六高級中學",
    "090306": "國立北港高級中學",
    "090315": "國立虎尾高級中學",
    "090401": "國立虎尾高級農工職業學校",
    "090402": "國立西螺高級農工職業學校",
    "090403": "國立斗六高級家事商業職業學校",
    "090404": "國立北港高級農工職業學校",
    "090413": "國立土庫高級商工職業學校",
    "090C02": "國立西螺農工進修部",
    "090C03": "國立斗六家商進修部",
    "090C13": "國立土庫商工進修學校",
    "090F01": "國立雲林特殊教育學校",
    "091307": "雲林縣私立永年高級中學",
    "091308": "雲林縣私立正心高級中學",
    "091311": "雲林縣私立文生高級中學",
    "091312": "雲林縣私立巨人高級中學",
    "091316": "揚子學校財團法人雲林縣揚子高級中等學校",
    "091318": "義峰學校財團法人雲林縣義峰高級中學",
    "091319": "福智學校財團法人雲林縣福智高級中等學校",
    "091320": "維多利亞學校財團法人雲林縣維多利亞實驗高級中學",
    "091410": "雲林縣私立大成高級商工職業學校",
    "091414": "雲林縣私立大德工業商業職業學校",
    "091B01": "雲林縣私立義峰高級中學附設進修學校",
    "091C10": "雲林縣私立大成高級商工職業學校附設進修學校",
    "091C14": "雲林縣私立大德工商職業學校附設進修學校",
    "094301": "雲林縣立斗南高級中學",
    "094307": "雲林縣立麥寮高級中學",
    "094308": "雲林縣立古坑華德福實驗高級中學",
    "094B07": "縣立麥寮高級中學進修學校",
    "100301": "國立東石高級中學",
    "100302": "國立新港藝術高級中學",
    "100402": "國立民雄高級農工職業學校",
    "100B01": "國立東石高級中學附設進修學校",
    "101303": "嘉義縣私立同濟高級中學",
    "101304": "嘉義縣私立協同高級中學",
    "101405": "嘉義縣私立協志高級工商職業學校",
    "101406": "嘉義縣私立萬能高級工商職業學校",
    "101407": "弘德學校財團法人嘉義縣弘德高級工商職業學校",
    "101B05": "財團法人臺灣省嘉義縣私立協同高級中學進修學校",
    "101C07": "弘德學校財團法人嘉義縣弘德高級工商職業學校進修學校",
    "101C08": "嘉義縣私立協志高級工商職業學校附設進修部",
    "101C09": "嘉義縣私立萬能高級工商職業學校附設進修學校",
    "104301": "嘉義縣立永慶高級中學",
    "104319": "嘉義縣立竹崎高級中學",
    "110302": "國立新豐高級中學",
    "110308": "國立臺南大學附屬高級中學",
    "110311": "國立北門高級中學",
    "110312": "國立新營高級中學",
    "110314": "國立後壁高級中學",
    "110315": "國立善化高級中學",
    "110317": "國立新化高級中學",
    "110328": "國立南科國際實驗高級中學",
    "110401": "國立新化高級工業職業學校",
    "110403": "國立白河高級商工職業學校",
    "110404": "國立北門高級農工職業學校",
    "110405": "國立曾文高級家事商業職業學校",
    "110406": "國立新營高級工業職業學校",
    "110407": "國立玉井高級工商職業學校",
    "110409": "國立臺南高級工業職業學校",
    "110410": "國立曾文高級農工職業學校",
    "110B02": "國立新豐高中進修學校",
    "110B08": "國立臺南大學附屬高級中學進修學校",
    "110C01": "國立新化高工進修學校",
    "110C04": "國立北門農工進修學校",
    "110C06": "國立新營高工進修學校",
    "110C09": "國立臺南高工進修部",
    "110F01": "國立臺南大學附屬啟聰學校",
    "111313": "臺南市私立南光高級中學",
    "111318": "臺南市私立鳳和高級中學",
    "111320": "臺南市私立港明高級中學",
    "111321": "興國學校財團法人臺南市興國高級中學",
    "111322": "臺南市私立明達高級中學",
    "111323": "方濟會學校財團法人臺南市黎明高級中學",
    "111326": "臺南市私立新榮高級中學",
    "111327": "臺南縣私立華濟永安高級中學",
    "111416": "臺南縣私立天仁高級工商職業學校",
    "111419": "陽明學校財團法人臺南市陽明高級工商職業學校",
    "111427": "臺南市私立育德工業家事職業學校",
    "111B20": "臺南市私立港明高級中學進修學校",
    "111B27": "臺南市私立樹德高級中學附設進修學校",
    "111C17": "臺南縣私立天仁高級工商職業學校附設進修學校",
    "111C18": "臺南縣私立華濟永安高級中學附設進修學校",
    "111C19": "臺南市私立陽明高級工商職業學校進修學校",
    "111C27": "臺南市私立育德工業家事職業學校附設進修學校",
    "114306": "臺南市立大灣高級中學",
    "114307": "臺南市立永仁高級中學",
    "120303": "國立鳳山高級中學",
    "120304": "國立岡山高級中學",
    "120305": "中正國防幹部預備學校",
    "120311": "國立旗美高級中學",
    "120319": "國立鳳新高級中學",
    "120401": "國立旗山高級農工職業學校",
    "120402": "國立岡山高級農工職業學校",
    "120409": "國立鳳山高級商工職業學校",
    "120C09": "國立鳳山高級商工職業進修部",
    "121306": "新光學校財團法人高雄市新光高級中學",
    "121307": "佛光山學校財團法人高雄市普門高級中學",
    "121308": "高雄市私立南海月光實驗教育學校",
    "121318": "高雄市私立正義高級中學",
    "121320": "高雄市私立義大國際高級中學",
    "121405": "中山學校財團法人高雄市中山高級工商職業學校",
    "121410": "高雄縣私立旗美高級商工職業學校",
    "121413": "高雄縣私立高英高級工商職業學校",
    "121415": "華德學校財團法人高雄市華德高級工業家事職業學校",
    "121417": "高雄縣私立高苑高級工商職業學校",
    "121B01": "新光學校財團法人高雄市新光高級中學附設進修學校",
    "121B06": "私立樂育高中進修學校",
    "121C05": "高雄市私立中山高級工商職業學校進修學校",
    "121C13": "高雄市私立高英高級工商職業學校進修學校",
    "121C15": "華德學校財團法人高雄市華德高級工業家事職業學校附設進修學校",
    "121C17": "高雄縣私立高苑高級工商職業學校附設進修學校",
    "123F01": "高雄市立仁武特殊教育學校",
    "124302": "高雄市立文山高級中學",
    "124311": "高雄市立林園高級中學",
    "124313": "高雄市立仁武高級中學",
    "124322": "高雄市立路竹高級中學",
    "124333": "高雄市立六龜高級中學",
    "124340": "高雄市立福誠高級中學",
    "124F01": "高雄市立高雄特殊教育學校",
    "130302": "國立屏東女子高級中學",
    "130305": "國立屏東高級中學",
    "130306": "國立潮州高級中學",
    "130322": "國立屏北高級中學",
    "130401": "國立內埔高級農工職業學校",
    "130403": "國立屏東高級工業職業學校",
    "130404": "國立佳冬高級農業職業學校",
    "130410": "國立東港高級海事水產職業學校",
    "130417": "國立恆春高級工商職業學校",
    "130601": "國立屏東大學附設實驗國民小學",
    "130C03": "國立屏東高級工業職業進修學校",
    "130C04": "國立佳冬高級農業職業進修學校",
    "130C17": "國立恆春高級工商職業進修學校",
    "130F01": "國立屏東特殊教育學校",
    "131307": "屏榮學校財團法人屏東縣屏榮高級中學",
    "131308": "陸興學校財團法人屏東縣陸興高級中學",
    "131311": "屏東縣私立美和高級中學",
    "131409": "屏東縣私立民生高級家事商業職業學校",
    "131416": "屏東縣私立華洲高級工業家事職業學校",
    "131418": "屏東縣私立日新高級工商職業學校",
    "131B07": "屏榮學校財團法人屏東縣屏榮高級中學附設進修學校",
    "131B08": "屏東縣私立新基高級中學附設進修學校",
    "131C09": "國立臺中科技大學附設高級商業職業進修學校",
    "131C16": "私立華洲高級工業家事職業進修學校",
    "131C18": "屏東縣私立日新高級工商職業學校附設進修學校",
    "131C19": "屏東縣私立民生高級家事商業職業學校附設進修學校",
    "134304": "屏東縣立大同高級中學",
    "134305": "屏東縣立東港高級中學",
    "134321": "屏東縣立枋寮高級中學",
    "134334": "屏東縣立來義高級中學",
    "140201": "國立臺東專科學校高職部",
    "140301": "國立臺東大學附屬體育高級中學",
    "140302": "國立臺東女子高級中學",
    "140303": "國立臺東高級中學",
    "140401": "國立臺東專科學校附設農工",
    "140404": "國立關山高級工商職業學校",
    "140405": "國立臺東高級商業職業學校",
    "140408": "國立成功商業水產職業學校",
    "140601": "國立臺東大學附設實驗國民小學",
    "140C01": "國立臺東專科學校附設高級農工職業進修學校",
    "140C02": "國立臺東高級商業職業學校附設進修學校",
    "140C05": "國立台東高級商業職業進修學校",
    "140C06": "國立成功商業水產職業學校附設進修學校",
    "140F01": "國立臺東大學附屬特殊教育學校",
    "141307": "未來學校財團法人臺東縣育仁高級中等學校",
    "141308": "均一學校財團法人臺東縣均一國際教育實驗高級中等學校",
    "141406": "臺東縣私立公東高級工業職業學校",
    "141B01": "臺東縣私立育仁高級中學附設進修學校",
    "144322": "臺東縣立蘭嶼高級中學",
    "144B22": "縣立蘭嶼高級中學進修學校",
    "150302": "國立花蓮女子高級中學",
    "150303": "國立花蓮高級中學",
    "150309": "國立玉里高級中學",
    "150401": "國立花蓮高級農業職業學校",
    "150404": "國立花蓮高級工業職業學校",
    "150405": "國立花蓮高級商業職業學校",
    "150411": "國立光復高級商工職業學校",
    "150601": "國立東華大學附設實驗國民小學",
    "150B09": "國立玉里高級中學附設進修學校",
    "150C04": "國立花蓮高級工業職業進修學校",
    "150C05": "國立花蓮高級商業職業進修部",
    "150C11": "國立光復高級商工職業進修部",
    "150F01": "國立花蓮特殊教育學校",
    "151306": "花蓮縣私立海星高級中學",
    "151307": "四維學校財團法人花蓮縣四維高級中學",
    "151312": "慈濟學校財團法人慈濟大學附屬高級中學",
    "151410": "上騰學校財團法人花蓮縣上騰高級工商職業學校",
    "151B01": "四維學校財團法人花蓮縣四維高級中學附設進修學校",
    "151B02": "臺灣省花蓮縣私立正德高級中學進修學校",
    "151C08": "花蓮縣私立國光高級商工職業學校進修學校",
    "151C10": "上騰學校財團法人花蓮縣上騰高級工商職業學校附設進修學校",
    "154301": "花蓮縣立體育高級中等學校",
    "154302": "花蓮縣立南平中學",
    "160302": "國立馬公高級中學",
    "160401": "國立澎湖高級海事水產職業學校",
    "170301": "國立基隆女子高級中學",
    "170302": "國立基隆高級中學",
    "170403": "國立臺灣海洋大學附屬基隆海事高級中等學校",
    "170404": "國立基隆高級商工職業學校",
    "170C03": "國立臺灣海洋大學附屬基隆海事高級中等進修學校",
    "170C04": "國立基隆高級商工職業進修學校",
    "170F01": "國立基隆特殊教育學校",
    "171306": "二信學校財團法人基隆市二信高級中學",
    "171308": "輔仁大學學校財團法人基隆市輔大聖心高級中學",
    "171405": "光隆學校財團法人基隆市光隆高級家事商業職業學校",
    "171407": "基隆市私立培德高級工業家事職業學校",
    "171B06": "二信學校財團法人基隆市二信高級中學附設進修學校",
    "171B08": "輔仁大學學校財團法人基隆市輔大聖心高級中學附設進修學校",
    "171C05": "基隆市私立光隆高級家事商業職業學校附設進修學校",
    "173304": "基隆市立中山高級中學",
    "173306": "基隆市立安樂高級中學",
    "173307": "基隆市立暖暖高級中學",
    "173308": "基隆市立八斗高級中學",
    "180301": "國立科學工業園區實驗高級中學",
    "180302": "國立新竹女子高級中學",
    "180309": "國立新竹高級中學",
    "180403": "國立新竹高級商業職業學校",
    "180404": "國立新竹高級工業職業學校",
    "180601": "國立清華大學附設實驗國民小學",
    "180C03": "國立新竹高級商業職業進修學校",
    "180C04": "國立新竹高級工業職業進修學校",
    "181305": "新竹市私立光復高級中學",
    "181306": "新竹市私立曙光女子高級中學",
    "181307": "新竹市私立磐石高級中學",
    "181308": "新竹市世界高級中學",
    "181B05": "新竹市私立光復高級中學進修學校",
    "181B07": "私立磐石高中進修學校",
    "181B08": "新竹市私立世界高級中學進修學校",
    "183306": "新竹市立成德高級中學",
    "183307": "新竹市立香山高級中學",
    "183313": "新竹市立建功高級中學",
    "183B07": "新竹市立香山高中進修學校",
    "190001": "國立臺中教育大學",
    "190301": "臺中市立臺中女子高級中等學校",
    "190302": "臺中市立臺中第一高級中等學校",
    "190303": "臺中市立臺中第二高級中等學校",
    "190315": "臺中市立文華高級中等學校",
    "190404": "臺中市立臺中家事商業高級中等學校",
    "190406": "國立中興大學附屬臺中高級農業職業學校",
    "190407": "臺中市立臺中工業高級中等學校",
    "190601": "國立臺中教育大學附設實驗國民小學",
    "190C01": "國立臺中科技大學附設高商進修學校",
    "190C04": "國立臺中高級家事商業職業進修學校",
    "190C06": "國立臺中高級農業職業進修學校",
    "190C07": "國立臺中高級工業職業進修學校",
    "190C08": "國立大甲高級工業職業學校附設進修學校",
    "190C09": "國立中興大學附屬臺中高級農業職業學校附設進修學校",
    "190C10": "國立豐原高級商業職業學校附設進修學校",
    "190F01": "臺中市立啟聰學校",
    "190F02": "臺中市立臺中特殊教育學校",
    "191301": "財團法人東海大學附屬高級中等學校",
    "191305": "臺中市私立新民高級中學",
    "191308": "宜寧學校財團法人臺中市宜寧高級中學",
    "191309": "明德學校財團法人臺中市明德高級中學",
    "191311": "臺中市私立衛道高級中學",
    "191313": "臺中市私立曉明女子高級中學",
    "191314": "臺中市私立嶺東高級中學",
    "191315": "葳格學校財團法人臺中市葳格高級中學",
    "191316": "臺中市私立磊川華德福實驗教育學校",
    "191412": "光華學校財團法人臺中市光華高級工業職業學校",
    "191B05": "私立新民高級中學進修學校",
    "191B09": "臺中市私立明德高級女子中學進修學校",
    "191B10": "明德學校財團法人臺中市明德高級中學附設進修部",
    "191B14": "私立嶺東高級中學進修學校",
    "191C12": "光華學校財團法人臺中市光華高級工業職業學校進修學校",
    "193303": "臺中市立忠明高級中學",
    "193313": "臺中市立西苑高級中學",
    "193316": "臺中市立惠文高級中學",
    "193317": "臺中市立東山高級中學",
    "193318": "臺中市立龍津高級中等學校",
    "200302": "國立嘉義女子高級中學",
    "200303": "國立嘉義高級中學",
    "200401": "國立華南高級商業職業學校",
    "200405": "國立嘉義高級工業職業學校",
    "200406": "國立嘉義高級商業職業學校",
    "200407": "國立嘉義高級家事職業學校",
    "200601": "國立嘉義大學附設實驗國民小學",
    "200B03": "國立嘉義高級中學進修部",
    "200C05": "國立嘉義高級工業職業進修學校",
    "200C06": "國立嘉義高級商業職業進修學校",
    "200C07": "國立嘉義高級家事職業進修學校",
    "200F01": "國立嘉義特殊教育學校",
    "201304": "嘉義市私立興華高級中學",
    "201309": "嘉義市私立仁義高級中學",
    "201310": "嘉義市私立嘉華高級中學",
    "201312": "嘉義市私立輔仁高級中學",
    "201313": "嘉義市私立宏仁女子高級中學",
    "201314": "嘉義市立仁高級中學",
    "201408": "嘉義市私立東吳高級工業家事職業學校",
    "201411": "嘉義市私立大同高級商業職業學校",
    "201B09": "嘉義市私立仁義高級中學附設進修學校",
    "201B10": "嘉義市私立興華高級中學附設進修學校",
    "201C08": "嘉義市私立東吳高級工業家事職業學校進修學校",
    "210303": "國立臺南第二高級中學",
    "210305": "國立臺南第一高級中學",
    "210306": "國立臺南女子高級中學",
    "210309": "國立臺南家齊高級中等學校",
    "210408": "國立臺南高級商業職業學校",
    "210416": "國立臺南高級海事水產職業學校",
    "210601": "國立臺南大學附設實驗國民小學",
    "210B05": "國立臺南第一高級中學附設進修學校",
    "210B09": "國立臺南家齊女子高級中學進修學校",
    "210C01": "國立成功大學附設高級工業職業進修學校",
    "210C08": "國立臺南高級商業職業學校進修學校",
    "210F01": "國立臺南特殊教育學校",
    "211301": "臺南市私立長榮高級中學",
    "211302": "臺南市私立長榮女子高級中學",
    "211304": "天主教聖功學校財團法人臺南市天主教聖功女子高級中學",
    "211310": "臺南光華學校財團法人臺南市光華高級中學",
    "211314": "臺南市六信高級中學",
    "211315": "臺南市私立瀛海高級中學",
    "211317": "臺南市私立崑山高級中學",
    "211318": "臺南市德光高級中學",
    "211320": "慈濟學校財團法人臺南市私立慈濟高級中學",
    "211407": "臺南市私立南英高級商工職業學校",
    "211412": "臺南市亞洲高級餐旅職業學校",
    "211419": "臺南市私立慈幼高級工商職業學校",
    "211B01": "臺南市私立長榮高級中學進修學校",
    "211B02": "臺南市私立長榮女子高級中學進修學校",
    "211B14": "臺南市私立六信高級中學附設進修學校",
    "211B17": "臺南市私立崑山高級中學進修學校",
    "211C07": "臺南市私立南英高級商工職業學校進修學校",
    "211C12": "臺南市私立亞洲高級餐旅職業學校附設進修學校",
    "211C19": "臺南市私立慈幼高級工商職業學校附設進修學校",
    "213303": "臺南市立南寧高級中學",
    "213316": "臺南市立土城高級中學",
    "311401": "臺北市私立育達高級商業家事職業學校",
    "313301": "臺北市立中崙高級中學",
    "313302": "臺北市立西松高級中學",
    "321301": "韻鏗學校財團法人臺北市協和祐德高級中等學校",
    "323301": "臺北市立永春高級中學",
    "323302": "臺北市立松山高級中學",
    "323401": "臺北市立松山高級工農職業學校",
    "323402": "臺北市立松山高級商業家事職業學校",
    "330301": "國立臺灣師範大學附屬高級中學",
    "330601": "國立臺北教育大學附設實驗國民小學",
    "331301": "臺北市私立延平高級中學",
    "331302": "臺北市私立金甌女子高級中學",
    "331303": "臺北市私立復興實驗高級中學",
    "331401": "臺北市私立東方高級工商職業學校",
    "331402": "臺北市私立喬治高級工商職業學校",
    "331403": "臺北市私立開平餐飲職業學校",
    "333301": "臺北市立和平高級中學",
    "333401": "臺北市立大安高級工業職業學校",
    "341301": "臺北市私立大同高級中學",
    "341302": "臺北市私立中興高級中學",
    "341401": "臺北市私立稻江高級護理家事職業學校",
    "343301": "臺北市立大同高級中學",
    "343302": "臺北市立大直高級中學",
    "343303": "臺北市立中山女子高級中學",
    "351301": "臺北市私立強恕高級中學",
    "351401": "臺北市私立開南高級商工職業學校",
    "351C01": "臺北市私立南華高級中學職業進修學校",
    "353301": "臺北市立成功高級中學",
    "353302": "臺北市立建國高級中學",
    "353303": "臺北市立第一女子高級中學",
    "361301": "臺北市私立靜修女子高級中學",
    "361401": "臺北市私立稻江高級商業職業學校",
    "361C01": "臺北市私立志仁高級中學職業進修學校",
    "363301": "臺北市立成淵高級中學",
    "363302": "臺北市立明倫高級中學",
    "363F01": "臺北市立啟聰學校",
    "371301": "臺北市私立立人高級中學",
    "373301": "臺北市立大理高級中學",
    "373302": "臺北市立華江高級中學",
    "380301": "國立政治大學附屬高級中學",
    "380601": "國立政治大學附設實驗國民小學",
    "381301": "臺北市私立大誠高級中學",
    "381302": "臺北市私立再興高級中學",
    "381303": "臺北市私立東山高級中學",
    "381304": "臺北市私立景文高級中學",
    "381305": "臺北市私立滬江高級中學",
    "383301": "臺北市立景美女子高級中學",
    "383302": "臺北市立萬芳高級中學",
    "383401": "臺北市立木柵高級工業職業學校",
    "383F01": "臺北市立文山特殊教育學校",
    "393301": "臺北市立內湖高級中學",
    "393302": "臺北市立育成高級中學",
    "393303": "臺北市立南港高級中學",
    "393401": "臺北市立內湖高級工業職業學校",
    "393402": "臺北市立南港高級工業職業學校",
    "400401": "國立臺灣戲曲學院附設高職部",
    "401301": "臺北市私立文德女子高級中學",
    "401302": "臺北市私立方濟高級中學",
    "401303": "臺北市私立達人女子高級中學",
    "403301": "臺北市立南湖高級中學",
    "403302": "臺北市立麗山高級中學",
    "411301": "華興學校財團法人臺北市私立華興高級中等學校",
    "411302": "臺北市私立泰北高級中學",
    "411303": "臺北市私立華岡藝術學校",
    "411304": "臺北市私立衛理女子高級中學",
    "413301": "臺北市立百齡高級中學",
    "413302": "臺北市立陽明高級中學",
    "413401": "臺北市立士林高級商業職業學校",
    "413F01": "臺北市立啟明學校",
    "413F02": "臺北市立啟智學校",
    "421301": "奎山學校財團法人臺北市奎山實驗高級中等學校",
    "421302": "臺北市私立十信高級中學",
    "421303": "臺北市私立薇閣高級中學",
    "421401": "臺北市私立惇敘高級工商職業學校",
    "423301": "臺北市立中正高級中學",
    "423302": "臺北市立復興高級中學",
    "521301": "天主教明誠學校財團法人高雄市明誠高級中學",
    "521302": "高雄市私立大榮高級中學",
    "521401": "高雄市私立中華高級藝術職業學校",
    "523301": "高雄市立鼓山高級中學",
    "533301": "高雄市立左營高級中學",
    "533302": "高雄市立新莊高級中學",
    "533401": "高雄市立海青高級工商職業學校",
    "540301": "國立中山大學附屬國光高級中學",
    "543301": "高雄市立中山高級中學",
    "543302": "高雄市立楠梓高級中學",
    "543F01": "高雄市立楠梓特殊學校",
    "551301": "立志學校財團法人高雄市立志高級中學",
    "551401": "高雄市私立樹德高級家事商業職業學校",
    "553301": "高雄市立三民高級中學",
    "553302": "高雄市立高雄高級中學",
    "553401": "高雄市立三民高級家事商業職業學校",
    "553402": "高雄市立高雄高級工業職業學校",
    "563301": "高雄市立新興高級中學",
    "563401": "高雄市立高雄高級商業職業學校",
    "573301": "高雄市立高雄女子高級中學",
    "580301": "國立高雄師範大學附屬高級中學",
    "581301": "天主教道明學校財團法人高雄市道明高級中學",
    "581302": "高雄市私立復華高級中學",
    "581401": "高雄市私立三信高級家事商業職業學校",
    "581402": "國際學校財團法人高雄市國際商工高級中等學校",
    "583301": "高雄市立中正高級中學",
    "583F01": "高雄市立高雄啟智學校",
    "593301": "高雄市立前鎮高級中學",
    "593302": "高雄市立瑞祥高級中學",
    "593401": "高雄市立中正高級工業職業學校",
    "593F01": "高雄市立成功啟智學校",
    "610301": "國立高雄餐旅大學附屬餐旅高級中等學校",
    "611401": "高雄市私立高鳳高級工業家事職業學校",
    "613301": "高雄市立小港高級中學",
    "710301": "國立金門高級中學",
    "710401": "國立金門高級農工職業學校",
    "710C01": "國立金門高級農工職業學校附設進修部",
    "720301": "國立馬祖高級中學",
    "F04U002": "臺北美國學校"
}
codeMap = {
    "課程類型": {
        "H": "普通型高中",
        "V": "技術型高中",
        "M": "綜合型高中",
        "S": "單科型高中",
        "C": "進修部",
        "E": "實用技能學程(日)",
        "F": "實用技能學程(夜)"
    },
    "群別代碼": {
        "11": "學術學程",
        "21": "機械群",
        "22": "動力機械群",
        "23": "電機與電子群",
        "24": "化工群",
        "25": "土木與建築群",
        "26": "商業群",
        "27": "外語群",
        "28": "設計群",
        "29": "農業群",
        "30": "食品群",
        "31": "家政群",
        "32": "餐旅群",
        "33": "水產群",
        "34": "海事群",
        "35": "藝術群",
        "36": "美容造型群",
        "40": "服務群",
        "41": "其他(綜合)"
    },
    "科別代碼": {
        "099": "其他",
        "101": "普通班",
        "102": "音樂班",
        "103": "美術班",
        "104": "舞蹈班",
        "105": "體育班",
        "106": "數理資優班",
        "107": "語文資優班",
        "108": "科學班",
        "111": "原住民藝能班",
        "121": "雙語部",
        "122": "戲劇班",
        "123": "人文與社會科學資優班",
        "124": "創造能力資優班",
        "196": "1年級不分群",
        "197": "學術社會學程",
        "198": "學術自然學程",
        "201": "農場經營科",
        "202": "園藝科",
        "204": "森林科",
        "205": "農業機械科",
        "206": "食品加工科",
        "214": "野生動物保育科",
        "215": "農產行銷科",
        "216": "造園科",
        "217": "畜產保健科",
        "301": "機械科",
        "302": "鑄造科",
        "303": "汽車科",
        "304": "板金科",
        "305": "資訊科",
        "306": "電子科",
        "307": "控制科",
        "308": "電機科",
        "309": "冷凍空調科",
        "311": "建築科",
        "312": "家具木工科",
        "315": "化工科",
        "316": "美工科",
        "318": "美術工藝科",
        "319": "紡織科",
        "321": "電機空調科",
        "331": "機工科",
        "332": "機械木模科",
        "335": "汽車修護科",
        "337": "配管科",
        "338": "模具科",
        "352": "染整科",
        "360": "機電科",
        "361": "陶瓷工程科",
        "363": "製圖科",
        "364": "重機科",
        "365": "土木科",
        "366": "室內空間設計科",
        "367": "環境檢驗科",
        "371": "電腦繪圖科",
        "372": "生物產業機電科",
        "373": "圖文傳播科",
        "374": "電腦機械製圖科",
        "380": "軌道車輛科",
        "381": "飛機修護科",
        "384": "航空電子科",
        "392": "動力機械科",
        "394": "金屬工藝科",
        "397": "消防工程科",
        "398": "空間測繪科",
        "399": "家具設計科",
        "401": "商業經營科",
        "402": "國際貿易科",
        "403": "會計事務科",
        "404": "資料處理科",
        "406": "廣告設計科",
        "407": "觀光事業科",
        "408": "餐飲管理科",
        "418": "不動產事務科",
        "424": "餐飲服務科",
        "425": "電子商務科",
        "426": "流通管理科",
        "427": "餐旅管理科",
        "429": "休閒管理科",
        "430": "多媒體設計科",
        "431": "多媒體應用科",
        "432": "電競經營科",
        "433": "應用英語科",
        "434": "應用日語科",
        "501": "家政科",
        "502": "服裝科",
        "503": "幼兒保育科",
        "504": "美容科",
        "505": "食品科",
        "512": "室內設計科",
        "513": "時尚模特兒科",
        "514": "照顧服務科",
        "515": "流行服飾科",
        "516": "時尚造型科",
        "517": "烘焙科",
        "701": "漁業科",
        "702": "輪機科",
        "703": "電子通信科",
        "705": "水產養殖科",
        "706": "水產經營科",
        "708": "航海科",
        "717": "航運管理科",
        "718": "水產食品科",
        "801": "戲劇科",
        "802": "音樂科",
        "803": "舞蹈科",
        "804": "美術科",
        "806": "影劇科",
        "807": "西樂科",
        "808": "國樂科",
        "809": "歌仔戲科",
        "813": "劇場藝術科",
        "816": "電影電視科",
        "817": "表演藝術科",
        "820": "多媒體動畫科",
        "821": "客家戲科",
        "822": "時尚工藝科",
        "823": "戲曲音樂科",
        "824": "京劇科",
        "825": "民俗技藝科",
        "826": "原住民藝能科",
        "911": "汽車美容服務科",
        "912": "門市服務科",
        "913": "農園藝整理服務科",
        "914": "包裝服務科",
        "915": "居家生活服務科",
        "916": "餐飲服務科",
        "917": "旅館服務科",
        "918": "保健按摩服務科",
        "929": "綜合職能科",
        "A01": "機械技術學程",
        "A02": "製圖學程",
        "A03": "製圖技術學程",
        "A04": "機械製圖學程",
        "A05": "電腦製圖學程",
        "A06": "農業機械技術學程",
        "A07": "電腦繪圖學程",
        "A08": "電腦輔助機械學程",
        "A09": "機械學程",
        "A10": "機械工程學程",
        "A12": "鑄造技術學程",
        "A13": "生物產業機電學程",
        "A14": "機械木模學程",
        "B01": "汽車技術學程",
        "B02": "汽車修護學程",
        "B03": "航空技術學程",
        "B04": "飛機修護學程",
        "B05": "工程機械技術學程",
        "B06": "汽機車技術學程",
        "B09": "動力機械學程",
        "B10": "動力機械技術學程",
        "B11": "工程機械學程",
        "C01": "電子技術學程",
        "C02": "資訊技術學程",
        "C03": "電機技術學程",
        "C04": "機電技術學程",
        "C05": "冷凍空調學程",
        "C06": "電器冷凍學程",
        "C07": "航空電子技術學程",
        "C08": "電腦應用學程",
        "C09": "電腦通訊學程",
        "C11": "資訊電子學程",
        "C12": "資訊科技學程",
        "C16": "機電整合學程",
        "C18": "電機電子技術學程",
        "C19": "電機電子學程",
        "C20": "控制學程",
        "D01": "化工技術學程",
        "D02": "環境檢驗技術學程",
        "D04": "化工學程",
        "D05": "衛生化工學程",
        "E01": "建築技術學程",
        "E02": "營建技術學程",
        "E03": "土木測量學程",
        "E04": "建築製圖學程",
        "E07": "土木建築技術學程",
        "F01": "資訊應用學程",
        "F02": "會計事務學程",
        "F03": "國際貿易學程",
        "F04": "商業服務學程",
        "F05": "商業經營學程",
        "F06": "流通服務學程",
        "F07": "物流服務學程",
        "F08": "資料處理學程",
        "F09": "電子商務學程",
        "F10": "商業事務學程",
        "F11": "文書事務學程",
        "F12": "商業應用學程",
        "F13": "商業學程",
        "F14": "電腦平面動畫學程",
        "F15": "流通管理學程",
        "F22": "商經實務學程",
        "F23": "資訊處理學程",
        "G01": "造園技術學程",
        "G02": "園藝技術學程",
        "G03": "農園技術學程",
        "G04": "畜產技術學程",
        "G06": "精緻農業學程",
        "G08": "畜產加工學程",
        "G09": "園藝與休閒學程",
        "G10": "綜合農業學程",
        "G11": "休閒農業管理學程",
        "G12": "畜產保健學程",
        "H01": "美容學程",
        "H02": "美容美髮學程",
        "H03": "服裝製作學程",
        "H04": "服裝設計學程",
        "H05": "服裝學程",
        "H06": "美容技術學程",
        "H07": "家政學程",
        "H08": "幼兒保育學程",
        "H09": "時尚設計學程",
        "H10": "幼老福利學程",
        "H11": "時尚造型學程",
        "I01": "影劇技術科",
        "I02": "表演技術科",
        "J01": "餐飲服務學程",
        "J02": "餐飲技術學程",
        "J03": "餐飲製作學程",
        "J04": "餐飲管理學程",
        "J05": "運動與休閒學程",
        "J06": "休閒事務學程",
        "J07": "觀光事務學程",
        "J08": "觀光事業學程",
        "J09": "觀光餐飲學程",
        "J11": "觀光學程",
        "J13": "運動休閒學程",
        "J14": "運動與休閒管理學程",
        "J17": "觀光服務學程",
        "J18": "餐飲經營學程",
        "J19": "食品烘焙學程",
        "K01": "農業技術科",
        "K03": "園藝技術科",
        "K09": "花藝技術科",
        "K11": "寵物經營科",
        "K13": "畜產加工科",
        "K15": "食品經營科",
        "K17": "茶葉技術科",
        "K19": "造園技術科",
        "K21": "烘焙食品科",
        "K25": "肉品加工科",
        "K27": "休閒農業科",
        "L01": "汽車修護科",
        "L03": "水電技術科",
        "L05": "裝潢技術科",
        "L15": "機械修護科",
        "L20": "機械板金科",
        "L21": "汽車電機科",
        "L23": "視聽電子修護科",
        "L25": "塗裝技術科",
        "L29": "電機修護科",
        "L31": "家電技術科",
        "L35": "營造技術科",
        "L37": "微電腦修護科",
        "L39": "金屬工藝科",
        "L41": "竹木工藝科",
        "L49": "冷凍空調修護科",
        "L50": "冷凍空調技術科",
        "L51": "模具基礎技術科",
        "L52": "模具技術科",
        "L55": "電腦繪圖科",
        "L58": "金銀珠寶加工科",
        "L59": "機械加工科",
        "L62": "鑄造技術科",
        "L63": "機車修護科",
        "L69": "化工技術科",
        "L71": "染整技術科",
        "L79": "流行飾品製作科",
        "L81": "服裝製作科",
        "M03": "廣告技術科",
        "M05": "商業事務科",
        "M09": "商用資訊科",
        "M11": "會計實務科",
        "M14": "觀光事務科",
        "M15": "文書處理科",
        "M17": "餐飲技術科",
        "M19": "銷售事務科",
        "M21": "中餐廚師科",
        "M27": "旅遊事務科",
        "M29": "多媒體技術科",
        "N01": "西服科",
        "N03": "女裝科",
        "N05": "美髮技術科",
        "N06": "美髮造型科",
        "N11": "美顏技術科",
        "N12": "美容造型科",
        "N23": "飾品製作科",
        "N25": "烹調技術科",
        "P01": "水產養殖技術科",
        "P09": "海事資訊處理科",
        "P12": "船舶機電科",
        "P13": "漁具製作科",
        "P17": "水產食品加工科",
        "P23": "休閒漁業科",
        "Q01": "水產養殖技術學程",
        "Q02": "水產養殖學程",
        "R01": "漁業學程",
        "U01": "原住民藝能學程",
        "U02": "電視廣播學程",
        "U03": "電影電視學程",
        "U04": "影視戲劇學程",
        "U05": "表演藝術學程",
        "V01": "廣告設計學程",
        "V02": "室內設計學程",
        "V03": "美工學程",
        "V04": "多媒體製作學程",
        "V05": "美工電腦設計學程",
        "V06": "美工技術學程",
        "V07": "商業設計學程",
        "V08": "室內裝潢學程",
        "V09": "家具技術學程",
        "V10": "設計科技學程",
        "V11": "美術設計學程",
        "V12": "多媒體設計學程",
        "V14": "圖文傳播學程",
        "V16": "流行造型設計學程",
        "V17": "空間設計學程",
        "V18": "室內空間設計學程",
        "V19": "造型設計學程",
        "V20": "工藝設計學程",
        "V22": "視覺傳達設計學程",
        "W01": "食品加工學程",
        "W03": "食品技術學程",
        "X02": "應用日語學程",
        "X03": "應用德語學程",
        "X04": "應用法語學程",
        "X11": "應用英語學程",
        "Y01": "銀髮族活動管理學程",
        "Y02": "綜合職能學程"
    },
    "班群": {
        "1": "建教合作-輪調式",
        "2": "建教合作-階梯式",
        "3": "建教合作-實習式",
        "4": "建教合作-其他式"
    },
    "課程類別": {
        "1": "部定必修",
        "2": "校訂必修",
        "3": "選修-加深加廣選修",
        "4": "選修-補強性選修",
        "5": "選修-多元選修",
        "6": "選修-其他",
        "7": "校訂選修",
        "8": "團體活動時間",
        "9": "彈性學習時間",
        "A": "大學預修課程",
        "B": "基礎訓練",
        "C": "職前訓練",
        "D": "寒暑假課程",
        "E": "返校課程",
        "F": "職業技能訓練"
    },
    "開課方式": {
        "0": "原班級",
        "1": "跨班選修(班群開課)",
        "2": "綜高跨年級選修",
        "A": "同科單班選修",
        "B": "同科跨班選修",
        "C": "跨學程  (綜高適用)",
        "D": "同校跨群選修",
        "E": "跨校選修"
    },
    "科目屬性": {
        "0": "不分屬性",
        "1": "一般科目",
        "2": "專業科目",
        "3": "實習科目",
        "4": "專精科目",
        "5": "專精科目(核心科目)",
        "6": "特殊需求領域",
        "A": "自主學習",
        "B": "選手培訓",
        "C": "充實(增廣)、補強性教學[全學期、不授予學分]",
        "D": "充實(增廣)、補強性教學[全學期、授予學分]",
        "E": "學校特色活動"
    },
    "領域名稱": {
        "00": "不分領域",
        "01": "語文領域",
        "02": "數學領域",
        "03": "社會領域",
        "04": "自然科學領域",
        "05": "藝術領域",
        "06": "綜合活動領域",
        "07": "科技領域",
        "08": "健康與體育領域",
        "09": "全民國防教育",
        "0A": "跨領域科目專題",
        "0B": "實作(實驗)及探索體驗",
        "0C": "職涯試探",
        "0D": "專題探究",
        "0E": "跨領域/科目統整",
        "0F": "通識性課程",
        "0G": "大學預修課程",
        "0H": "第二外國語文",
        "0I": "本土語文",
        "0J": "綜合活動與科技領域",
        "0R": "競技體育技能領域",
        "0S": "體育專業學科",
        "0T": "體育專項術科",
        "11": "特殊需求領域(身心障礙)",
        "12": "特殊需求領域(資賦優異)",
        "13": "特殊需求領域(音樂專長)",
        "14": "特殊需求領域(美術專長)",
        "15": "特殊需求領域(舞蹈專長)",
        "16": "特殊需求領域(戲劇專長)",
        "17": "特殊需求領域(體育專長)",
        "18": "特殊需求領域(實驗課程)",
        "91": "藝術才能專長領域",
        "92": "生涯發展",
        "93": "職能探索",
        "94": "運動防護",
        "A1": "數值控制技能領域",
        "A2": "精密機械製造技能領域",
        "A3": "模型設計與鑄造技能領域",
        "A4": "電腦輔助機械設計技能領域",
        "A5": "自動化整合技能領域",
        "A6": "金屬成形與管線技能領域",
        "B1": "車輛技能領域",
        "B2": "機器腳踏車技能領域",
        "B3": "液氣壓技能領域",
        "B4": "動力機械技能領域",
        "C1": "晶片設計技能領域",
        "C2": "微電腦應用技能領域",
        "C3": "自動控制技能領域",
        "C4": "電機工程技能領域",
        "C5": "冷凍空調技能領域",
        "D1": "化工技能領域",
        "D2": "紡染技能領域",
        "E2": "專業製圖技能領域",
        "E3": "土木測量技能領域",
        "F1": "商業與財會技能領域",
        "F2": "跨境商務技能領域",
        "F3": "資訊應用技能領域",
        "G1": "英語文技能領域",
        "G2": "日語文技能領域",
        "G3": "職場實務技能領域",
        "H1": "平面設計技能領域",
        "H2": "立體造形技能領域",
        "H3": "數位成型技能領域",
        "H4": "數位影音技能領域",
        "H5": "互動媒體技能領域",
        "H6": "空間設計技能領域",
        "I1": "農業生產與休閒生態技能領域",
        "I2": "動物飼養及保健技能領域",
        "J1": "食品加工技能領域",
        "J2": "檢驗分析技能領域",
        "K1": "整體造型技能領域",
        "K2": "服裝實務技能領域",
        "K3": "生活應用技能領域",
        "L1": "廚藝技能領域",
        "L2": "烘焙技能領域",
        "L3": "旅宿技能領域",
        "L4": "旅遊技能領域",
        "M1": "漁航技能領域",
        "M2": "漁業技能領域",
        "M3": "水域活動安全技能領域",
        "M4": "觀賞水族技能領域",
        "M5": "經濟水族技能領域",
        "M6": "區域特色水族技能領域",
        "M7": "海面養殖技能領域",
        "N1": "船舶金工技能領域",
        "N2": "船舶機電控制技能領域",
        "N3": "船舶動力技能領域",
        "N4": "船舶作業技能領域",
        "N5": "船舶操縱技能領域",
        "N6": "電子導航技能領域",
        "N7": "船舶維護與繫固作業技能領域",
        "O1": "視覺表現技能領域",
        "O2": "展演製作技能領域",
        "O3": "數位影音技能領域",
        "O4": "音樂藝術技能領域",
        "O5": "舞蹈藝術技能領域",
        "O6": "表演藝術實務技能領域",
        "U1": "車輛整理技能領域",
        "U2": "門市技能領域",
        "U3": "物品整理技能領域",
        "U4": "農園藝技能領域",
        "U5": "產品加工技能領域",
        "U6": "裝配技能領域",
        "U7": "生活照護技能領域",
        "U8": "家務處理技能領域",
        "U9": "餐飲製作技能領域",
        "UA": "旅館房務技能領域",
        "UB": "按摩技能領域",
        "UC": "紓壓保健技能領域",
        "UD": "民俗技能領域",
        "UE": "寵物照顧技能領域",
        "UF": "美髮技能領域"
    },
    "科目名稱代碼": {
        "01": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "國語文"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "機械製造"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "水彩"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械基礎實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "國語文"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "國語文"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "機械製造"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械基礎實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "生活管理"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "生活管理"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "生活管理"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "生活管理"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "生活管理"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "生活管理"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "生活管理"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "生活管理"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "國學常識"
            },
            {
                "課程類別": "4",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "補強-國語文"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "11",
                "Desc": "生活管理"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "生活管理"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "生活管理"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "生活管理"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "生活管理"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "生活管理"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "生活管理"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "生活管理"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "國語文"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "國語文"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "機械製造"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械基礎實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "機械基礎實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "01",
                "Desc": "國學常識"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "機械基礎實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "01",
                "Desc": "國學常識"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "生活管理"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "生活管理"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "生活管理"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "生活管理"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "生活管理"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "生活管理"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "生活管理"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "生活管理"
            },
            {
                "課程類別": "8",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "團體活動時間"
            },
            {
                "課程類別": "9",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "彈性學習時間"
            },
            {
                "課程類別": "B",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "基礎訓練"
            },
            {
                "課程類別": "C",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "職前訓練"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "國語文"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "國語文"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "機械製造"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械基礎實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "國語文"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "國語文"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "機械製造"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械基礎實習"
            },
            {
                "課程類別": "F",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "職業技能訓練(一)"
            },
            {
                "課程類別": "F",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "職業技能訓練(一)"
            }
        ],
        "02": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "英語文"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "機件原理"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "水墨"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎電學實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "英語文"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "英語文"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "機件原理"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎電學實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "語文表達與傳播應用"
            },
            {
                "課程類別": "4",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "補強-英語文"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "11",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "英語文"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "英語文"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "機件原理"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎電學實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "基礎電學實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "01",
                "Desc": "語文表達與傳播應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "基礎電學實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "01",
                "Desc": "語文表達與傳播應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "8",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "班級活動"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "英語文"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "英語文"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "機件原理"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎電學實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "英語文"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "英語文"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "機件原理"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎電學實習"
            },
            {
                "課程類別": "F",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "職業技能訓練(二)"
            },
            {
                "課程類別": "F",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "職業技能訓練(二)"
            }
        ],
        "1A": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "語文"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "水產概要"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "C3",
                "Desc": "電工實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "語文"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "水產概要"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電工實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "安全教育與傷害防護"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "語文"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "水產概要"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "電工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "08",
                "Desc": "安全教育與傷害防護"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "電工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "08",
                "Desc": "安全教育與傷害防護"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "語文"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "水產概要"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電工實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "語文"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "水產概要"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電工實習"
            }
        ],
        "03": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "機械力學"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "版畫"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械製圖實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "數學"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "機械力學"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械製圖實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "學習策略"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "學習策略"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "學習策略"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "學習策略"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "學習策略"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "學習策略"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "學習策略"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "學習策略"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "各類文學選讀"
            },
            {
                "課程類別": "4",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "補強-數學"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "11",
                "Desc": "學習策略"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "學習策略"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "學習策略"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "學習策略"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "學習策略"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "學習策略"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "學習策略"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "學習策略"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "數學"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "機械力學"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械製圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "機械製圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "01",
                "Desc": "各類文學選讀"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "機械製圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "01",
                "Desc": "各類文學選讀"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "學習策略"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "學習策略"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "學習策略"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "學習策略"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "學習策略"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "學習策略"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "學習策略"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "學習策略"
            },
            {
                "課程類別": "8",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "綜合活動"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "數學"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "機械力學"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械製圖實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "數學"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "機械力學"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械製圖實習"
            },
            {
                "課程類別": "F",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "職業技能訓練(三)"
            },
            {
                "課程類別": "F",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "職業技能訓練(三)"
            }
        ],
        "04": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學A類"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "機械材料"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "美術鑑賞"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助製圖與實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "機械材料"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助製圖與實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "職業教育"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "職業教育"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "職業教育"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "職業教育"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "職業教育"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "職業教育"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "職業教育"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "職業教育"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "專題閱讀與研究"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "11",
                "Desc": "職業教育"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "職業教育"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "職業教育"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "職業教育"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "職業教育"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "職業教育"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "職業教育"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "職業教育"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "數學A"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學A"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "機械材料"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助製圖與實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "電腦輔助製圖與實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "01",
                "Desc": "專題閱讀與研究"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "電腦輔助製圖與實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "01",
                "Desc": "專題閱讀與研究"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "職業教育"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "職業教育"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "職業教育"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "職業教育"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "職業教育"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "職業教育"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "職業教育"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "職業教育"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "機械材料"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助製圖與實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "機械材料"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助製圖與實習"
            },
            {
                "課程類別": "F",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "職業技能訓練(四)"
            },
            {
                "課程類別": "F",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "職業技能訓練(四)"
            }
        ],
        "05": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學B類"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "應用力學"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "書法"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械加工實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "應用力學"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械加工實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "英語聽講"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "11",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "數學B"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學B"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "應用力學"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械加工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "機械加工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "01",
                "Desc": "英語聽講"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "機械加工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "01",
                "Desc": "英語聽講"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "應用力學"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械加工實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "應用力學"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械加工實習"
            },
            {
                "課程類別": "F",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "職業技能訓練(五)"
            },
            {
                "課程類別": "F",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "職業技能訓練(五)"
            }
        ],
        "06": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學A版"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "引擎原理"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "素描"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "A1",
                "Desc": "電腦輔助設計實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "引擎原理"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助設計實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "點字"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "點字"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "點字"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "點字"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "點字"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "點字"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "點字"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "點字"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "英文閱讀與寫作"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "11",
                "Desc": "點字"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "點字"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "點字"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "點字"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "點字"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "點字"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "點字"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "點字"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "引擎原理"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助設計實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "電腦輔助設計實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "01",
                "Desc": "英文閱讀與寫作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "電腦輔助設計實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "01",
                "Desc": "英文閱讀與寫作"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "點字"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "點字"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "點字"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "點字"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "點字"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "點字"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "點字"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "點字"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "引擎原理"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助設計實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "引擎原理"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助設計實習"
            },
            {
                "課程類別": "F",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "職業技能訓練(六)"
            },
            {
                "課程類別": "F",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "職業技能訓練(六)"
            }
        ],
        "07": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學B版"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "底盤原理"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "基本設計"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "A1",
                "Desc": "數值控制機械實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "底盤原理"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數值控制機械實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "定向行動"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "定向行動"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "定向行動"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "定向行動"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "定向行動"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "定向行動"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "定向行動"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "定向行動"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "英文作文"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "11",
                "Desc": "定向行動"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "定向行動"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "定向行動"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "定向行動"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "定向行動"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "定向行動"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "定向行動"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "定向行動"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "底盤原理"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數值控制機械實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "數值控制機械實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "01",
                "Desc": "英文作文"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "數值控制機械實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "01",
                "Desc": "英文作文"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "定向行動"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "定向行動"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "定向行動"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "定向行動"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "定向行動"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "定向行動"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "定向行動"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "定向行動"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "底盤原理"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數值控制機械實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "底盤原理"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數值控制機械實習"
            }
        ],
        "08": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學C版"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "基本電學"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "彩繪技法"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "A2",
                "Desc": "電腦輔助製造實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "基本電學"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助製造實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學甲"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "11",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "基本電學"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助製造實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "電腦輔助製造實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "02",
                "Desc": "數學甲"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "電腦輔助製造實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "02",
                "Desc": "數學甲"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "基本電學"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助製造實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "基本電學"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助製造實習"
            }
        ],
        "09": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "歷史"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "電子學"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "創意表現"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "A2",
                "Desc": "綜合機械加工實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "歷史"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "歷史"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "電子學"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "綜合機械加工實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學乙"
            },
            {
                "課程類別": "4",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "補強-歷史"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "11",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "歷史"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "歷史"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "電子學"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "綜合機械加工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "綜合機械加工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "02",
                "Desc": "數學乙"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "綜合機械加工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "02",
                "Desc": "數學乙"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "歷史"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "歷史"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "電子學"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "綜合機械加工實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "歷史"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "歷史"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "電子學"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "綜合機械加工實習"
            }
        ],
        "0A": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "地理"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "數位邏輯設計"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "藝術鑑賞"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "A3",
                "Desc": "鑄造實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "地理"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "地理"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "數位邏輯設計"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "鑄造實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "創造力"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "創造力"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "創造力"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "創造力"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "創造力"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "創造力"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "創造力"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "創造力"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "族群、性別與國家的歷史"
            },
            {
                "課程類別": "4",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "補強-地理"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "11",
                "Desc": "創造力"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "創造力"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "創造力"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "創造力"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "創造力"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "創造力"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "創造力"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "創造力"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "地理"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "地理"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "數位邏輯設計"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "鑄造實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "鑄造實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "03",
                "Desc": "族群、性別與國家的歷史"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "鑄造實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "03",
                "Desc": "族群、性別與國家的歷史"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "創造力"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "創造力"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "創造力"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "創造力"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "創造力"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "創造力"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "創造力"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "創造力"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "地理"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "地理"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "數位邏輯設計"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "鑄造實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "地理"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "地理"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "數位邏輯設計"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "鑄造實習"
            }
        ],
        "0B": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "公民與社會"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "微處理機"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "主修"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "A3",
                "Desc": "模型製作實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "公民與社會"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "公民與社會"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "微處理機"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "模型製作實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "領導才能"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "領導才能"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "領導才能"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "領導才能"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "領導才能"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "領導才能"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "領導才能"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "領導才能"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "科技、環境與藝術的歷史"
            },
            {
                "課程類別": "4",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "補強-公民與社會"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "11",
                "Desc": "領導才能"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "領導才能"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "領導才能"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "領導才能"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "領導才能"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "領導才能"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "領導才能"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "領導才能"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "公民與社會"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "公民與社會"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "微處理機"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "模型製作實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "模型製作實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "03",
                "Desc": "科技、環境與藝術的歷史"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "模型製作實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "03",
                "Desc": "科技、環境與藝術的歷史"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "領導才能"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "領導才能"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "領導才能"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "領導才能"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "領導才能"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "領導才能"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "領導才能"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "領導才能"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "公民與社會"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "公民與社會"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "微處理機"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "模型製作實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "公民與社會"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "公民與社會"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "微處理機"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "模型製作實習"
            }
        ],
        "1B": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "社會"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "船藝"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "C3",
                "Desc": "可程式控制實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "社會"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "船藝"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "可程式控制實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "運動與健康"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "社會"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "船藝"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "可程式控制實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "可程式控制實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "08",
                "Desc": "運動與健康"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "可程式控制實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "08",
                "Desc": "運動與健康"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "社會"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "船藝"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "可程式控制實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "社會"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "船藝"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "可程式控制實習"
            }
        ],
        "0C": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "物理"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "電工機械"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "合奏"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "A3",
                "Desc": "數值控制機械實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "物理"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "物理"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "電工機械"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "情意發展"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "情意發展"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "情意發展"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "情意發展"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "情意發展"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "情意發展"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "情意發展"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "情意發展"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "空間資訊科技"
            },
            {
                "課程類別": "4",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "補強-物理"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "11",
                "Desc": "情意發展"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "情意發展"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "情意發展"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "情意發展"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "情意發展"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "情意發展"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "情意發展"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "情意發展"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "物理"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "物理"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "電工機械"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "03",
                "Desc": "空間資訊科技"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "03",
                "Desc": "空間資訊科技"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "情意發展"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "情意發展"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "情意發展"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "情意發展"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "情意發展"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "情意發展"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "情意發展"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "情意發展"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "物理"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "物理"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "電工機械"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "物理"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "物理"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "電工機械"
            }
        ],
        "0D": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "化學"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "冷凍空調原理"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "合唱"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "A4",
                "Desc": "機械工作圖實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "化學"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "化學"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "冷凍空調原理"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械工作圖實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "2",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "社會環境議題"
            },
            {
                "課程類別": "4",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "補強-化學"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "11",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "化學"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "化學"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "冷凍空調原理"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械工作圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "機械工作圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "03",
                "Desc": "社會環境議題"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "機械工作圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "03",
                "Desc": "社會環境議題"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "11",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "12",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "13",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "14",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "15",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "16",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "7",
                "科目屬性": "6",
                "領域名稱": "17",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "化學"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "化學"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "冷凍空調原理"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械工作圖實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "化學"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "化學"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "冷凍空調原理"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械工作圖實習"
            }
        ],
        "0E": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "生物"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "普通化學"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "和聲"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "A4",
                "Desc": "實物測繪實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "生物"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "生物"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "普通化學"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "實物測繪實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "現代社會與經濟"
            },
            {
                "課程類別": "4",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "補強-生物"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "生物"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "生物"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "普通化學"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "實物測繪實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "實物測繪實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "03",
                "Desc": "現代社會與經濟"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "實物測繪實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "03",
                "Desc": "現代社會與經濟"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "生物"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "生物"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "普通化學"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "實物測繪實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "生物"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "生物"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "普通化學"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "實物測繪實習"
            }
        ],
        "0F": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "地球科學"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "分析化學"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "音樂史"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "A4",
                "Desc": "電腦輔助設計實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "地球科學"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "地球科學"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "分析化學"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "民主政治與法律"
            },
            {
                "課程類別": "4",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "補強-地球科學"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "地球科學"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "地球科學"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "分析化學"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "03",
                "Desc": "民主政治與法律"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "03",
                "Desc": "民主政治與法律"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "地球科學"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "地球科學"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "分析化學"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "地球科學"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "地球科學"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "分析化學"
            }
        ],
        "0G": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "物理-探究A"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "基礎化工"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "音樂欣賞"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "A4",
                "Desc": "電腦輔助機械設計製圖實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "基礎化工"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助機械設計製圖實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "探究與實作：歷史學探究"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "基礎化工"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助機械設計製圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "電腦輔助機械設計製圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "03",
                "Desc": "探究與實作：歷史學探究"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "電腦輔助機械設計製圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "03",
                "Desc": "探究與實作：歷史學探究"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "基礎化工"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助機械設計製圖實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "基礎化工"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助機械設計製圖實習"
            }
        ],
        "0H": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "化學-探究A"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "化工裝置"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "音樂基礎訓練"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "A5",
                "Desc": "氣油壓控制實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "化工裝置"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "氣油壓控制實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "探究與實作：地理與人文社會科學研究"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "化工裝置"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "氣油壓控制實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "氣油壓控制實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "03",
                "Desc": "探究與實作：地理與人文社會科學研究"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "氣油壓控制實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "03",
                "Desc": "探究與實作：地理與人文社會科學研究"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "化工裝置"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "氣油壓控制實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "化工裝置"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "氣油壓控制實習"
            }
        ],
        "0I": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "生物-探究A"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "土木建築工程與技術概論"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "副修"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "A5",
                "Desc": "機電實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "土木建築工程與技術概論"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機電實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "探究與實作：公共議題與社會探究"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "土木建築工程與技術概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機電實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "機電實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "03",
                "Desc": "探究與實作：公共議題與社會探究"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "機電實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "03",
                "Desc": "探究與實作：公共議題與社會探究"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "土木建築工程與技術概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機電實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "土木建築工程與技術概論"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機電實習"
            }
        ],
        "0J": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "地球科學-探究A"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "構造與施工法"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "樂理"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "A5",
                "Desc": "機電整合實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "構造與施工法"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機電整合實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-力學一"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "構造與施工法"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機電整合實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "機電整合實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "04",
                "Desc": "選修物理-力學一"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "機電整合實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "04",
                "Desc": "選修物理-力學一"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "構造與施工法"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機電整合實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "構造與施工法"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機電整合實習"
            }
        ],
        "0K": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "物理-探究B"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "基礎工程力學"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "中國舞"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "A6",
                "Desc": "金屬成形實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "基礎工程力學"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "金屬成形實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-力學二與熱學"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "基礎工程力學"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "金屬成形實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "金屬成形實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "04",
                "Desc": "選修物理-力學二與熱學"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "金屬成形實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "04",
                "Desc": "選修物理-力學二與熱學"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "基礎工程力學"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "金屬成形實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "基礎工程力學"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "金屬成形實習"
            }
        ],
        "0L": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "化學-探究B"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "商業概論"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "芭蕾"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "A6",
                "Desc": "銲接實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "商業概論"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "銲接實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-波動、光及聲音"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "商業概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "銲接實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "銲接實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "04",
                "Desc": "選修物理-波動、光及聲音"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "銲接實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "04",
                "Desc": "選修物理-波動、光及聲音"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "商業概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "銲接實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "商業概論"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "銲接實習"
            }
        ],
        "0M": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "生物-探究B"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "數位科技概論"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "91",
                "Desc": "現代舞"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "A6",
                "Desc": "金屬管線實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "數位科技概論"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "金屬管線實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-電磁現象一"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "數位科技概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "金屬管線實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "金屬管線實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "04",
                "Desc": "選修物理-電磁現象一"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "金屬管線實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "04",
                "Desc": "選修物理-電磁現象一"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "數位科技概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "金屬管線實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "數位科技概論"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "金屬管線實習"
            }
        ],
        "0N": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "地球科學-探究B"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "會計學"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械工作法及實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "會計學"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械工作法及實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-電磁現象二與量子現象"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "會計學"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械工作法及實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "機械工作法及實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "04",
                "Desc": "選修物理-電磁現象二與量子現象"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "機械工作法及實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "04",
                "Desc": "選修物理-電磁現象二與量子現象"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "會計學"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械工作法及實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "會計學"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機械工作法及實習"
            }
        ],
        "0O": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "物理A版"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "經濟學"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機電製圖實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "經濟學"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機電製圖實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-物質與能量"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "經濟學"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機電製圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "機電製圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "04",
                "Desc": "選修化學-物質與能量"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "機電製圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "04",
                "Desc": "選修化學-物質與能量"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "經濟學"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機電製圖實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "經濟學"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機電製圖實習"
            }
        ],
        "0P": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "物理B版"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "設計概論"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "引擎實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "設計概論"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "引擎實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-物質構造與反應速率"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "設計概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "引擎實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "引擎實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "04",
                "Desc": "選修化學-物質構造與反應速率"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "引擎實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "04",
                "Desc": "選修化學-物質構造與反應速率"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "設計概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "引擎實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "設計概論"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "引擎實習"
            }
        ],
        "0Q": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "化學A版"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "色彩原理"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "底盤實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "色彩原理"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "底盤實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-化學反應與平衡一"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "色彩原理"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "底盤實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "底盤實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "04",
                "Desc": "選修化學-化學反應與平衡一"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "底盤實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "04",
                "Desc": "選修化學-化學反應與平衡一"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "色彩原理"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "底盤實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "色彩原理"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "底盤實習"
            }
        ],
        "0R": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "化學B版"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "造形原理"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電工電子實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "造形原理"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電工電子實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-化學反應與平衡二"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "造形原理"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電工電子實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "電工電子實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "04",
                "Desc": "選修化學-化學反應與平衡二"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "電工電子實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "04",
                "Desc": "選修化學-化學反應與平衡二"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "造形原理"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電工電子實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "造形原理"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電工電子實習"
            }
        ],
        "0S": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "生物A版"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "創意潛能開發"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電系實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "創意潛能開發"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電系實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-有機化學與應用科技"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "創意潛能開發"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電系實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "電系實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "04",
                "Desc": "選修化學-有機化學與應用科技"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "電系實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "04",
                "Desc": "選修化學-有機化學與應用科技"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "創意潛能開發"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電系實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "創意潛能開發"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電系實習"
            }
        ],
        "0T": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "生物B版"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "設計與生活美學"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "B1",
                "Desc": "車輛空調檢修實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "設計與生活美學"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車輛空調檢修實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修生物-細胞與遺傳"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "設計與生活美學"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車輛空調檢修實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "車輛空調檢修實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "04",
                "Desc": "選修生物-細胞與遺傳"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "車輛空調檢修實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "04",
                "Desc": "選修生物-細胞與遺傳"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "設計與生活美學"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車輛空調檢修實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "設計與生活美學"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車輛空調檢修實習"
            }
        ],
        "1C": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "自然科學"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "輪機"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "C3",
                "Desc": "機電整合實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "自然科學"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "輪機"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "健康與休閒生活"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "自然科學"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "輪機"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "08",
                "Desc": "健康與休閒生活"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "08",
                "Desc": "健康與休閒生活"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "自然科學"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "輪機"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "自然科學"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "輪機"
            }
        ],
        "0U": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "音樂"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "農業概論"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "B1",
                "Desc": "車輛底盤檢修實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "音樂"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "音樂"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "農業概論"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車輛底盤檢修實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修生物-動物體的構造與功能"
            },
            {
                "課程類別": "4",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "補強-音樂"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "音樂"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "音樂"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "農業概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車輛底盤檢修實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "車輛底盤檢修實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "04",
                "Desc": "選修生物-動物體的構造與功能"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "車輛底盤檢修實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "04",
                "Desc": "選修生物-動物體的構造與功能"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "音樂"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "音樂"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "農業概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車輛底盤檢修實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "音樂"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "音樂"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "農業概論"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車輛底盤檢修實習"
            }
        ],
        "0V": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "美術"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "生物技術概論"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "B1",
                "Desc": "車身電器系統綜合檢修實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "美術"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "美術"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "生物技術概論"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車身電器系統綜合檢修實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修生物-生命的起源與植物體的構造與功能"
            },
            {
                "課程類別": "4",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "補強-美術"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "美術"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "美術"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "生物技術概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車身電器系統綜合檢修實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "車身電器系統綜合檢修實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "04",
                "Desc": "選修生物-生命的起源與植物體的構造與功能"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "車身電器系統綜合檢修實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "04",
                "Desc": "選修生物-生命的起源與植物體的構造與功能"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "美術"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "美術"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "生物技術概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車身電器系統綜合檢修實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "美術"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "美術"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "生物技術概論"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車身電器系統綜合檢修實習"
            }
        ],
        "0W": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "藝術生活"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "農業安全衛生"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "B2",
                "Desc": "機器腳踏車基礎實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "藝術生活"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "藝術生活"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "農業安全衛生"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機器腳踏車基礎實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修生物-生態、演化及生物多樣性"
            },
            {
                "課程類別": "4",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "補強-藝術生活"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "藝術生活"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "藝術生活"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "農業安全衛生"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機器腳踏車基礎實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "機器腳踏車基礎實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "04",
                "Desc": "選修生物-生態、演化及生物多樣性"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "機器腳踏車基礎實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "04",
                "Desc": "選修生物-生態、演化及生物多樣性"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "藝術生活"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "藝術生活"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "農業安全衛生"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機器腳踏車基礎實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "藝術生活"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "藝術生活"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "農業安全衛生"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機器腳踏車基礎實習"
            }
        ],
        "1D": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "藝術"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "海上安全法規概論"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "C4",
                "Desc": "智慧居家監控實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "藝術"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "海上安全法規概論"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "智慧居家監控實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "藝術"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "海上安全法規概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "智慧居家監控實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "智慧居家監控實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "智慧居家監控實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "藝術"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "海上安全法規概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "智慧居家監控實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "藝術"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "海上安全法規概論"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "智慧居家監控實習"
            }
        ],
        "0X": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "生命教育"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "生命科學概論"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "B2",
                "Desc": "機器腳踏車檢修實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "生命教育"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "生命教育"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "生命科學概論"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機器腳踏車檢修實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修地球科學-地質與環境"
            },
            {
                "課程類別": "4",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "補強-生命教育"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "生命教育"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "生命教育"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "生命科學概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機器腳踏車檢修實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "機器腳踏車檢修實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "04",
                "Desc": "選修地球科學-地質與環境"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "機器腳踏車檢修實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "04",
                "Desc": "選修地球科學-地質與環境"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "生命教育"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "生命教育"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "生命科學概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機器腳踏車檢修實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "生命教育"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "生命教育"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "生命科學概論"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "機器腳踏車檢修實習"
            }
        ],
        "0Y": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "生涯規劃"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "食品加工"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "B3",
                "Desc": "液氣壓基礎實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "生涯規劃"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "生涯規劃"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "食品加工"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "液氣壓基礎實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修地球科學-大氣、海洋及天文"
            },
            {
                "課程類別": "4",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "補強-生涯規劃"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "生涯規劃"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "生涯規劃"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "食品加工"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "液氣壓基礎實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "液氣壓基礎實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "04",
                "Desc": "選修地球科學-大氣、海洋及天文"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "液氣壓基礎實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "04",
                "Desc": "選修地球科學-大氣、海洋及天文"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "生涯規劃"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "生涯規劃"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "食品加工"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "液氣壓基礎實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "生涯規劃"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "生涯規劃"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "食品加工"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "液氣壓基礎實習"
            }
        ],
        "0Z": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "家政"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "食品微生物"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "B3",
                "Desc": "液氣壓檢修實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "家政"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "家政"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "食品微生物"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "液氣壓檢修實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "表演創作"
            },
            {
                "課程類別": "4",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "補強-家政"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "家政"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "家政"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "食品微生物"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "液氣壓檢修實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "液氣壓檢修實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "05",
                "Desc": "表演創作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "液氣壓檢修實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "05",
                "Desc": "表演創作"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "家政"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "家政"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "食品微生物"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "液氣壓檢修實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "家政"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "家政"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "食品微生物"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "液氣壓檢修實習"
            }
        ],
        "10": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "法律與生活"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "食品化學與分析"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "B4",
                "Desc": "動力機械操作實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "法律與生活"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "法律與生活"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "食品化學與分析"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動力機械操作實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "基本設計"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "法律與生活"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "法律與生活"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "食品化學與分析"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動力機械操作實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "動力機械操作實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "05",
                "Desc": "基本設計"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "動力機械操作實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "05",
                "Desc": "基本設計"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "法律與生活"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "法律與生活"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "食品化學與分析"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動力機械操作實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "法律與生活"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "法律與生活"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "食品化學與分析"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動力機械操作實習"
            }
        ],
        "11": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "環境科學概論"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家政概論"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "B4",
                "Desc": "動力機械引擎實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "環境科學概論"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "環境科學概論"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家政概論"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動力機械引擎實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "多媒體音樂"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "環境科學概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "環境科學概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家政概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動力機械引擎實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "動力機械引擎實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "05",
                "Desc": "多媒體音樂"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "動力機械引擎實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "05",
                "Desc": "多媒體音樂"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "環境科學概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "環境科學概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家政概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動力機械引擎實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "環境科學概論"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "環境科學概論"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家政概論"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動力機械引擎實習"
            }
        ],
        "1E": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "綜合活動"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "海運概論"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "C4",
                "Desc": "電力電子應用實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "綜合活動"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "海運概論"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電力電子應用實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "綜合活動"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "海運概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電力電子應用實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "電力電子應用實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "電力電子應用實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "綜合活動"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "海運概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電力電子應用實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "綜合活動"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "海運概論"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電力電子應用實習"
            }
        ],
        "12": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "生活科技"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "色彩概論"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基本電學實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "生活科技"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "生活科技"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "色彩概論"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基本電學實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "新媒體藝術"
            },
            {
                "課程類別": "4",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "補強-生活科技"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "生活科技"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "生活科技"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "色彩概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基本電學實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "基本電學實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "05",
                "Desc": "新媒體藝術"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "基本電學實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "05",
                "Desc": "新媒體藝術"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "生活科技"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "生活科技"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "色彩概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基本電學實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "生活科技"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "生活科技"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "色彩概論"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基本電學實習"
            }
        ],
        "13": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "資訊科技"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家政職業衛生與安全"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電子學實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "資訊科技"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "資訊科技"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家政職業衛生與安全"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電子學實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "未來想像與生涯進路"
            },
            {
                "課程類別": "4",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "補強-資訊科技"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "資訊科技"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "資訊科技"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家政職業衛生與安全"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電子學實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "電子學實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "06",
                "Desc": "未來想像與生涯進路"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "電子學實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "06",
                "Desc": "未來想像與生涯進路"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "資訊科技"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "資訊科技"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家政職業衛生與安全"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電子學實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "資訊科技"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "資訊科技"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家政職業衛生與安全"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電子學實習"
            }
        ],
        "1F": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "科技"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "藝術概論"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "C4",
                "Desc": "電工機械實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "科技"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "藝術概論"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電工機械實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "科技"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "藝術概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電工機械實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "電工機械實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "電工機械實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "科技"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "藝術概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電工機械實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "科技"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "藝術概論"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電工機械實習"
            }
        ],
        "14": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "健康與護理"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家庭教育"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "C1",
                "Desc": "程式設計實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "健康與護理"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "健康與護理"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家庭教育"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "程式設計實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "思考：智慧的啟航"
            },
            {
                "課程類別": "4",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "補強-健康與護理"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "健康與護理"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "健康與護理"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家庭教育"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "程式設計實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "程式設計實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "06",
                "Desc": "思考：智慧的啟航"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "程式設計實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "06",
                "Desc": "思考：智慧的啟航"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "健康與護理"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "健康與護理"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家庭教育"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "程式設計實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "健康與護理"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "健康與護理"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家庭教育"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "程式設計實習"
            }
        ],
        "15": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "體育"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家政職業倫理"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "C1",
                "Desc": "可程式邏輯設計實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "體育"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "體育"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家政職業倫理"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "可程式邏輯設計實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "創新生活與家庭"
            },
            {
                "課程類別": "4",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "補強-體育"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "體育"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "體育"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家政職業倫理"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "可程式邏輯設計實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "可程式邏輯設計實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "06",
                "Desc": "創新生活與家庭"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "可程式邏輯設計實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "06",
                "Desc": "創新生活與家庭"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "體育"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "體育"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家政職業倫理"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "可程式邏輯設計實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "體育"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "體育"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家政職業倫理"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "可程式邏輯設計實習"
            }
        ],
        "1G": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "健康與體育"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "藝術欣賞"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "C5",
                "Desc": "能源與冷凍實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "健康與體育"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "藝術欣賞"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "能源與冷凍實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "健康與體育"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "藝術欣賞"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "能源與冷凍實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "能源與冷凍實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "能源與冷凍實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "健康與體育"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "藝術欣賞"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "能源與冷凍實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "健康與體育"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "藝術欣賞"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "能源與冷凍實習"
            }
        ],
        "16": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "09",
                "Desc": "全民國防教育"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "行銷與服務"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "C1",
                "Desc": "單晶片微處理機實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "全民國防教育"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "09",
                "Desc": "全民國防教育"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "行銷與服務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "單晶片微處理機實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "工程設計專題"
            },
            {
                "課程類別": "4",
                "科目屬性": "1",
                "領域名稱": "09",
                "Desc": "補強-全民國防教育"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "全民國防教育"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "09",
                "Desc": "全民國防教育"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "行銷與服務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "單晶片微處理機實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "單晶片微處理機實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "07",
                "Desc": "工程設計專題"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "單晶片微處理機實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "07",
                "Desc": "工程設計專題"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "全民國防教育"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "09",
                "Desc": "全民國防教育"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "行銷與服務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "單晶片微處理機實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "全民國防教育"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "09",
                "Desc": "全民國防教育"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "行銷與服務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "單晶片微處理機實習"
            }
        ],
        "1H": [
            {
                "課程類別": "1",
                "科目屬性": "1",
                "領域名稱": "0J",
                "Desc": "綜合活動與科技"
            },
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "藝術與科技"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "C5",
                "Desc": "能源與空調實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "綜合活動與科技"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "藝術與科技"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "能源與空調實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "綜合活動與科技"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "藝術與科技"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "能源與空調實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "能源與空調實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "能源與空調實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "綜合活動與科技"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "藝術與科技"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "能源與空調實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "綜合活動與科技"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "藝術與科技"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "能源與空調實習"
            }
        ],
        "17": [
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家政美學"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "C2",
                "Desc": "行動裝置應用實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家政美學"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "行動裝置應用實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "領域課程：科技應用專題"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家政美學"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "行動裝置應用實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "行動裝置應用實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "07",
                "Desc": "領域課程：科技應用專題"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "行動裝置應用實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "07",
                "Desc": "領域課程：科技應用專題"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家政美學"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "行動裝置應用實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "家政美學"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "行動裝置應用實習"
            }
        ],
        "18": [
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "觀光餐旅業導論"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "C2",
                "Desc": "微電腦應用實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "觀光餐旅業導論"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "微電腦應用實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "進階程式設計"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "觀光餐旅業導論"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "微電腦應用實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "微電腦應用實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "07",
                "Desc": "進階程式設計"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "微電腦應用實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "07",
                "Desc": "進階程式設計"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "觀光餐旅業導論"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "微電腦應用實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "觀光餐旅業導論"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "微電腦應用實習"
            }
        ],
        "19": [
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "觀光餐旅英語會話"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "C2",
                "Desc": "介面電路控制實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "觀光餐旅英語會話"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "介面電路控制實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "領域課程：機器人專題"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "觀光餐旅英語會話"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "介面電路控制實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "介面電路控制實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "07",
                "Desc": "領域課程：機器人專題"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "介面電路控制實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "07",
                "Desc": "領域課程：機器人專題"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "觀光餐旅英語會話"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "介面電路控制實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "觀光餐旅英語會話"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "介面電路控制實習"
            }
        ],
        "1I": [
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "服務導論"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "C5",
                "Desc": "節能技術實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "生活管理"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "服務導論"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "節能技術實習"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "生活管理"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "生活管理"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "生活管理"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "服務導論"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "節能技術實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "節能技術實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "節能技術實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "生活管理"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "服務導論"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "節能技術實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "生活管理"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "服務導論"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "節能技術實習"
            }
        ],
        "1J": [
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "衛生與安全概論"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "普通化學實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "衛生與安全概論"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "普通化學實習"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "衛生與安全概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "普通化學實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "普通化學實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "普通化學實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "衛生與安全概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "普通化學實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "社會技巧"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "衛生與安全概論"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "普通化學實習"
            }
        ],
        "1K": [
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "事務機器與電腦應用概論"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "分析化學實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "學習策略"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "事務機器與電腦應用概論"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "分析化學實習"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "學習策略"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "學習策略"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "學習策略"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "事務機器與電腦應用概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "分析化學實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "分析化學實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "分析化學實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "學習策略"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "事務機器與電腦應用概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "分析化學實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "學習策略"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "事務機器與電腦應用概論"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "分析化學實習"
            }
        ],
        "1O": [
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "經濟學概要"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "D2",
                "Desc": "紡染檢驗實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "定向行動"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "經濟學概要"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "紡染檢驗實習"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "定向行動"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "定向行動"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "定向行動"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "經濟學概要"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "紡染檢驗實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "紡染檢驗實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "紡染檢驗實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "定向行動"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "經濟學概要"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "紡染檢驗實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "定向行動"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "經濟學概要"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "紡染檢驗實習"
            }
        ],
        "1P": [
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "美容造型概論"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "測量實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "美容造型概論"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "測量實習"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "美容造型概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "測量實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "測量實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "測量實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "美容造型概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "測量實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "功能性動作訓練"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "美容造型概論"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "測量實習"
            }
        ],
        "1Q": [
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "美容職業安全與衛生"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "設計與技術實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "美容職業安全與衛生"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "設計與技術實習"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "美容職業安全與衛生"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "設計與技術實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "設計與技術實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "設計與技術實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "美容職業安全與衛生"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "設計與技術實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "輔助科技應用"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "美容職業安全與衛生"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "設計與技術實習"
            }
        ],
        "1L": [
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "0S",
                "Desc": "運動學概論"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "D1",
                "Desc": "化工裝置實習"
            },
            {
                "課程類別": "1",
                "科目屬性": "4",
                "領域名稱": "0S",
                "Desc": "運動學概論"
            },
            {
                "課程類別": "1",
                "科目屬性": "5",
                "領域名稱": "0S",
                "Desc": "運動學概論"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "職業教育"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "運動學概論"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "化工裝置實習"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "職業教育"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "職業教育"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "職業教育"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "運動學概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "化工裝置實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "化工裝置實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "化工裝置實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "職業教育"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "運動學概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "化工裝置實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "職業教育"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "運動學概論"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "化工裝置實習"
            }
        ],
        "1M": [
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "0T",
                "Desc": "專項體能訓練"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "D1",
                "Desc": "化工儀器實習"
            },
            {
                "課程類別": "1",
                "科目屬性": "4",
                "領域名稱": "0T",
                "Desc": "專項體能訓練"
            },
            {
                "課程類別": "1",
                "科目屬性": "5",
                "領域名稱": "0T",
                "Desc": "專項體能訓練"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "專項體能訓練"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "化工儀器實習"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "專項體能訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "化工儀器實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "化工儀器實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "化工儀器實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "專項體能訓練"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "化工儀器實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "溝通訓練"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "專項體能訓練"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "化工儀器實習"
            }
        ],
        "1N": [
            {
                "課程類別": "1",
                "科目屬性": "2",
                "領域名稱": "0T",
                "Desc": "專項技術訓練"
            },
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "D2",
                "Desc": "紡染實習"
            },
            {
                "課程類別": "1",
                "科目屬性": "4",
                "領域名稱": "0T",
                "Desc": "專項技術訓練"
            },
            {
                "課程類別": "1",
                "科目屬性": "5",
                "領域名稱": "0T",
                "Desc": "專項技術訓練"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "點字"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "專項技術訓練"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "紡染實習"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "點字"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "點字"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "點字"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "專項技術訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "紡染實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "紡染實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "紡染實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "點字"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "專項技術訓練"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "紡染實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "點字"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "專項技術訓練"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "紡染實習"
            }
        ],
        "1R": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "營建技術實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "創造力"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "營建技術實習"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "創造力"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "創造力"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "創造力"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "營建技術實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "營建技術實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "營建技術實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "創造力"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "營建技術實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "創造力"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "營建技術實習"
            }
        ],
        "1S": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "材料與試驗"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "領導才能"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "材料與試驗"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "領導才能"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "領導才能"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "領導才能"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "材料與試驗"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "材料與試驗"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "材料與試驗"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "領導才能"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "材料與試驗"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "領導才能"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "材料與試驗"
            }
        ],
        "1T": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "製圖實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "情意發展"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "製圖實習"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "情意發展"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "情意發展"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "情意發展"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "製圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "製圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "製圖實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "情意發展"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "製圖實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "情意發展"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "製圖實習"
            }
        ],
        "1U": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助製圖實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助製圖實習"
            },
            {
                "課程類別": "6",
                "科目屬性": "0",
                "領域名稱": "00",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "6",
                "科目屬性": "6",
                "領域名稱": "00",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助製圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "電腦輔助製圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "電腦輔助製圖實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助製圖實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "獨立研究或專長領域"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦輔助製圖實習"
            }
        ],
        "1Z": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位科技應用"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位科技應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位科技應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "數位科技應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "數位科技應用"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位科技應用"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位科技應用"
            }
        ],
        "20": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "商業溝通"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "商業溝通"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "商業溝通"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "商業溝通"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "01",
                "Desc": "國語文"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "商業溝通"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "01",
                "Desc": "國語文"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "商業溝通"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "商業溝通"
            }
        ],
        "2R": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "繪畫基礎實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "繪畫基礎實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "繪畫基礎實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "繪畫基礎實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "繪畫基礎實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "繪畫基礎實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "繪畫基礎實習"
            }
        ],
        "2S": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "表現技法實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "表現技法實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "表現技法實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "表現技法實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "表現技法實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "表現技法實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "表現技法實習"
            }
        ],
        "2T": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基本設計實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基本設計實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基本設計實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "基本設計實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "基本設計實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基本設計實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基本設計實習"
            }
        ],
        "2U": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎圖學實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎圖學實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎圖學實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "基礎圖學實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "基礎圖學實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎圖學實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎圖學實習"
            }
        ],
        "2V": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦向量繪圖實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦向量繪圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦向量繪圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "電腦向量繪圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "電腦向量繪圖實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦向量繪圖實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電腦向量繪圖實習"
            }
        ],
        "2W": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位影像處理實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位影像處理實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位影像處理實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "數位影像處理實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "數位影像處理實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位影像處理實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位影像處理實習"
            }
        ],
        "3B": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農業資訊管理實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "馬來西亞語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "馬來西亞語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "馬來西亞語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農業資訊管理實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "馬來西亞語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "馬來西亞語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "馬來西亞語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "馬來西亞語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "馬來西亞語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農業資訊管理實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "農業資訊管理實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "0H",
                "Desc": "馬來西亞語"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "農業資訊管理實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "0H",
                "Desc": "馬來西亞語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "馬來西亞語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "馬來西亞語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "馬來西亞語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農業資訊管理實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "馬來西亞語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "馬來西亞語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "馬來西亞語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農業資訊管理實習"
            }
        ],
        "3C": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農園場管理實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農園場管理實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農園場管理實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "農園場管理實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "農園場管理實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農園場管理實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農園場管理實習"
            }
        ],
        "3D": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "林場管理實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "林場管理實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "林場管理實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "林場管理實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "林場管理實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "林場管理實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "林場管理實習"
            }
        ],
        "3E": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "牧場管理實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "牧場管理實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "牧場管理實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "牧場管理實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "牧場管理實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "牧場管理實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "牧場管理實習"
            }
        ],
        "3N": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食品加工實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食品加工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食品加工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "食品加工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "食品加工實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食品加工實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食品加工實習"
            }
        ],
        "3O": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食品微生物實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食品微生物實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食品微生物實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "食品微生物實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "食品微生物實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食品微生物實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食品微生物實習"
            }
        ],
        "3P": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食品化學與分析實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食品化學與分析實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食品化學與分析實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "食品化學與分析實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "食品化學與分析實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食品化學與分析實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食品化學與分析實習"
            }
        ],
        "3V": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "多媒材創作實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "多媒材創作實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "多媒材創作實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "多媒材創作實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "多媒材創作實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "多媒材創作實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "多媒材創作實務"
            }
        ],
        "3W": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "飾品設計與實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "飾品設計與實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "飾品設計與實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "飾品設計與實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "飾品設計與實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "飾品設計與實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "飾品設計與實務"
            }
        ],
        "49": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "餐飲服務技術"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "數學乙"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學乙"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "餐飲服務技術"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "數學乙"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學乙"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "餐飲服務技術"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "餐飲服務技術"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "餐飲服務技術"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "數學乙"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學乙"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "餐飲服務技術"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "數學乙"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學乙"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "餐飲服務技術"
            }
        ],
        "4A": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "飲料實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "族群、性別與國家的歷史"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "族群、性別與國家的歷史"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "飲料實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "族群、性別與國家的歷史"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "族群、性別與國家的歷史"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "飲料實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "飲料實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "飲料實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "族群、性別與國家的歷史"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "族群、性別與國家的歷史"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "飲料實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "族群、性別與國家的歷史"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "族群、性別與國家的歷史"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "飲料實務"
            }
        ],
        "4J": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水產生物實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修物理-力學一"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-力學一"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水產生物實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修物理-力學一"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-力學一"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水產生物實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "水產生物實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "水產生物實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修物理-力學一"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-力學一"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水產生物實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修物理-力學一"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-力學一"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水產生物實務"
            }
        ],
        "4Z": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基本電工與實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "表演創作"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "表演創作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基本電工與實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "表演創作"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "表演創作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基本電工與實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "基本電工與實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "基本電工與實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "表演創作"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "表演創作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基本電工與實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "表演創作"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "表演創作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基本電工與實習"
            }
        ],
        "50": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船舶自動控制實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "基本設計"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "基本設計"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船舶自動控制實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "基本設計"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "基本設計"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船舶自動控制實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "船舶自動控制實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "船舶自動控制實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "基本設計"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "基本設計"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船舶自動控制實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "基本設計"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "基本設計"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船舶自動控制實習"
            }
        ],
        "5G": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "展演實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "展演實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "展演實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "展演實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "展演實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "展演實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "展演實務"
            }
        ],
        "5H": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "音樂展演實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "音樂展演實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "音樂展演實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "音樂展演實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "音樂展演實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "音樂展演實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "音樂展演實務"
            }
        ],
        "5I": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "表演藝術展演實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "表演藝術展演實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "表演藝術展演實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "表演藝術展演實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "表演藝術展演實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "表演藝術展演實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "表演藝術展演實務"
            }
        ],
        "5J": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "視覺藝術展演實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "視覺藝術展演實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "視覺藝術展演實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "視覺藝術展演實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "視覺藝術展演實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "視覺藝術展演實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "視覺藝術展演實務"
            }
        ],
        "5K": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "音像藝術展演實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "音像藝術展演實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "音像藝術展演實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "音像藝術展演實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "音像藝術展演實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "音像藝術展演實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "音像藝術展演實務"
            }
        ],
        "5Z": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎清潔實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎清潔實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎清潔實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "基礎清潔實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "基礎清潔實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎清潔實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎清潔實務"
            }
        ],
        "60": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎清潔實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎清潔實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎清潔實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "基礎清潔實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "基礎清潔實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎清潔實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎清潔實作"
            }
        ],
        "61": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "職場清潔實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "職場清潔實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "職場清潔實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "職場清潔實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "職場清潔實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "職場清潔實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "職場清潔實作"
            }
        ],
        "62": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "顧客服務實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "顧客服務實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "顧客服務實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "顧客服務實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "顧客服務實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "顧客服務實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "顧客服務實務"
            }
        ],
        "63": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "顧客服務實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "顧客服務實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "顧客服務實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "顧客服務實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "顧客服務實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "顧客服務實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "顧客服務實作"
            }
        ],
        "75": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "會計實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "會計實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "會計實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "數學A"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "02",
                "Desc": "數學A"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "數學A"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "02",
                "Desc": "數學A"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "會計實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "會計實務"
            }
        ],
        "76": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "牧場實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "牧場實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "牧場實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "數學B"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "02",
                "Desc": "數學B"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "數學B"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "02",
                "Desc": "數學B"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "牧場實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "牧場實習"
            }
        ],
        "77": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農園場實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農園場實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農園場實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農園場實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農園場實習"
            }
        ],
        "78": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農業資訊處理"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農業資訊處理"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農業資訊處理"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農業資訊處理"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農業資訊處理"
            }
        ],
        "79": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "寵物飼養與管理實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "寵物飼養與管理實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "寵物飼養與管理實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "寵物飼養與管理實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "寵物飼養與管理實習"
            }
        ],
        "7A": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水產增殖實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水產增殖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水產增殖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "機械製造"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "機械製造"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水產增殖實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水產增殖實習"
            }
        ],
        "7B": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基本電工實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基本電工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基本電工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "機件原理"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "機件原理"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基本電工實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基本電工實習"
            }
        ],
        "7C": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "美髮實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "美髮實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "美髮實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "機械力學"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "機械力學"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "美髮實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "美髮實務"
            }
        ],
        "7D": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "美顏實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "美顏實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "美顏實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "機械材料"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "機械材料"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "美顏實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "美顏實務"
            }
        ],
        "1V": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "E2",
                "Desc": "建築製圖實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "建築製圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "建築製圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "建築製圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "建築製圖實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "建築製圖實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "建築製圖實習"
            }
        ],
        "1W": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "E2",
                "Desc": "施工圖實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "施工圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "施工圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "施工圖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "施工圖實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "施工圖實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "施工圖實習"
            }
        ],
        "1X": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "E3",
                "Desc": "工程測量實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "工程測量實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "工程測量實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "工程測量實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "工程測量實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "工程測量實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "工程測量實習"
            }
        ],
        "1Y": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "E3",
                "Desc": "地形測量實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "地形測量實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "地形測量實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "地形測量實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "地形測量實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "地形測量實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "地形測量實習"
            }
        ],
        "21": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "F1",
                "Desc": "門市經營實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "客家語文"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "客家語文"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "客家語文"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "門市經營實務"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "客家語文"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "客家語文"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "客家語文"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "客家語文"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "客家語文"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "門市經營實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "門市經營實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "01",
                "Desc": "英語文"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "門市經營實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "01",
                "Desc": "英語文"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "客家語文"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "客家語文"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "客家語文"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "門市經營實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "客家語文"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "客家語文"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "客家語文"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "門市經營實務"
            }
        ],
        "22": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "F1",
                "Desc": "行銷實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "行銷實務"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "行銷實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "行銷實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "02",
                "Desc": "數學"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "行銷實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "02",
                "Desc": "數學"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "行銷實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "行銷實務"
            }
        ],
        "23": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "F1",
                "Desc": "會計軟體應用"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "閩南語文"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "閩南語文"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "閩南語文"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "會計軟體應用"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "閩南語文"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "閩南語文"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "閩南語文"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "閩南語文"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "閩南語文"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "會計軟體應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "會計軟體應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "03",
                "Desc": "歷史"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "會計軟體應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "03",
                "Desc": "歷史"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "閩南語文"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "閩南語文"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "閩南語文"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "會計軟體應用"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "閩南語文"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "閩南語文"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "閩南語文"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "會計軟體應用"
            }
        ],
        "24": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "F1",
                "Desc": "金融與證券投資實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-噶瑪蘭語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-噶瑪蘭語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-噶瑪蘭語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "金融與證券投資實務"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-噶瑪蘭語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-噶瑪蘭語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-噶瑪蘭語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-噶瑪蘭語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-噶瑪蘭語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "金融與證券投資實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "金融與證券投資實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "03",
                "Desc": "地理"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "金融與證券投資實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "03",
                "Desc": "地理"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-噶瑪蘭語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "金融與證券投資實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-噶瑪蘭語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "金融與證券投資實務"
            }
        ],
        "25": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "F2",
                "Desc": "國際貿易實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-邵語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-邵語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-邵語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "國際貿易實務"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-邵語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-邵語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-邵語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-邵語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-邵語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "國際貿易實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "國際貿易實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "03",
                "Desc": "公民與社會"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "國際貿易實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "03",
                "Desc": "公民與社會"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-邵語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "國際貿易實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-邵語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "國際貿易實務"
            }
        ],
        "26": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "F2",
                "Desc": "會計軟體應用"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-魯凱語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-魯凱語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-魯凱語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-魯凱語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-魯凱語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-魯凱語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-魯凱語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-魯凱語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "簡報實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "簡報實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "04",
                "Desc": "物理"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "簡報實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "04",
                "Desc": "物理"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-魯凱語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "簡報實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-魯凱語"
            }
        ],
        "27": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "F2",
                "Desc": "貿易英文實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-賽夏語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-賽夏語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-賽夏語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "貿易英文實務"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-賽夏語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-賽夏語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-賽夏語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-賽夏語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-賽夏語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "貿易英文實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "貿易英文實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "04",
                "Desc": "化學"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "貿易英文實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "04",
                "Desc": "化學"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-賽夏語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "貿易英文實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-賽夏語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "貿易英文實務"
            }
        ],
        "28": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "F3",
                "Desc": "多媒體製作與應用"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-排灣語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-排灣語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-排灣語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "多媒體製作與應用"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-排灣語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-排灣語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-排灣語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-排灣語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-排灣語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "多媒體製作與應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "多媒體製作與應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "04",
                "Desc": "生物"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "多媒體製作與應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "04",
                "Desc": "生物"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-排灣語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "多媒體製作與應用"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-排灣語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "多媒體製作與應用"
            }
        ],
        "29": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "F3",
                "Desc": "程式語言與設計"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-賽德克語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-賽德克語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-賽德克語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "程式語言與設計"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-賽德克語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-賽德克語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-賽德克語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-賽德克語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-賽德克語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "程式語言與設計"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "程式語言與設計"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "04",
                "Desc": "地球科學"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "程式語言與設計"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "04",
                "Desc": "地球科學"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-賽德克語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "程式語言與設計"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-賽德克語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "程式語言與設計"
            }
        ],
        "2A": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "F3",
                "Desc": "資料庫應用"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-泰雅語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-泰雅語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-泰雅語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "資料庫應用"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-泰雅語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-泰雅語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-泰雅語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-泰雅語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-泰雅語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "資料庫應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "資料庫應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "05",
                "Desc": "音樂"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "資料庫應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "05",
                "Desc": "音樂"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-泰雅語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "資料庫應用"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-泰雅語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "資料庫應用"
            }
        ],
        "2B": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "G1",
                "Desc": "初階英語聽講練習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-布農語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-布農語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-布農語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "初階英語聽講練習"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-布農語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-布農語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-布農語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-布農語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-布農語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "初階英語聽講練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "初階英語聽講練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "05",
                "Desc": "美術"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "初階英語聽講練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "05",
                "Desc": "美術"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-布農語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "初階英語聽講練習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-布農語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "初階英語聽講練習"
            }
        ],
        "2C": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "G1",
                "Desc": "中階英語聽講練習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-鄒語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-鄒語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-鄒語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "中階英語聽講練習"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-鄒語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-鄒語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-鄒語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-鄒語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-鄒語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "中階英語聽講練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "中階英語聽講練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "05",
                "Desc": "藝術生活"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "中階英語聽講練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "05",
                "Desc": "藝術生活"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-鄒語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "中階英語聽講練習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-鄒語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "中階英語聽講練習"
            }
        ],
        "2D": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "G1",
                "Desc": "高階英語聽講練習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-阿美語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-阿美語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-阿美語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "高階英語聽講練習"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-阿美語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-阿美語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-阿美語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-阿美語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-阿美語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "高階英語聽講練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "高階英語聽講練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "06",
                "Desc": "生命教育"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "高階英語聽講練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "06",
                "Desc": "生命教育"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-阿美語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "高階英語聽講練習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-阿美語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "高階英語聽講練習"
            }
        ],
        "2E": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "G1",
                "Desc": "初階英文閱讀與寫作練習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-太魯閣語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-太魯閣語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-太魯閣語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "初階英文閱讀與寫作練習"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-太魯閣語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-太魯閣語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-太魯閣語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-太魯閣語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-太魯閣語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "初階英文閱讀與寫作練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "初階英文閱讀與寫作練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "06",
                "Desc": "生涯規劃"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "初階英文閱讀與寫作練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "06",
                "Desc": "生涯規劃"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-太魯閣語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "初階英文閱讀與寫作練習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-太魯閣語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "初階英文閱讀與寫作練習"
            }
        ],
        "2F": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "G1",
                "Desc": "中階英文閱讀與寫作練習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-拉阿魯哇語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-拉阿魯哇語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-拉阿魯哇語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "中階英文閱讀與寫作練習"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-拉阿魯哇語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-拉阿魯哇語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-拉阿魯哇語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-拉阿魯哇語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-拉阿魯哇語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "中階英文閱讀與寫作練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "中階英文閱讀與寫作練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "06",
                "Desc": "家政"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "中階英文閱讀與寫作練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "06",
                "Desc": "家政"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-拉阿魯哇語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "中階英文閱讀與寫作練習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-拉阿魯哇語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "中階英文閱讀與寫作練習"
            }
        ],
        "2G": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "G1",
                "Desc": "高階英文閱讀與寫作練習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-撒奇萊雅語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-撒奇萊雅語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-撒奇萊雅語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "高階英文閱讀與寫作練習"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-撒奇萊雅語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-撒奇萊雅語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-撒奇萊雅語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-撒奇萊雅語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-撒奇萊雅語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "高階英文閱讀與寫作練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "高階英文閱讀與寫作練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "06",
                "Desc": "法律與生活"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "高階英文閱讀與寫作練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "06",
                "Desc": "法律與生活"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-撒奇萊雅語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "高階英文閱讀與寫作練習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-撒奇萊雅語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "高階英文閱讀與寫作練習"
            }
        ],
        "2H": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "G1",
                "Desc": "英文商業書信寫作"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-卡那卡那富語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-卡那卡那富語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-卡那卡那富語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "英文商業書信寫作"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-卡那卡那富語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-卡那卡那富語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-卡那卡那富語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-卡那卡那富語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-卡那卡那富語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "英文商業書信寫作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "英文商業書信寫作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "06",
                "Desc": "環境科學概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "英文商業書信寫作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "06",
                "Desc": "環境科學概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-卡那卡那富語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "英文商業書信寫作"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-卡那卡那富語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "英文商業書信寫作"
            }
        ],
        "2I": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "G2",
                "Desc": "日語聽解入門練習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-雅美語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-雅美語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-雅美語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語聽解入門練習"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-雅美語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-雅美語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-雅美語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-雅美語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-雅美語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語聽解入門練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "日語聽解入門練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "07",
                "Desc": "生活科技"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "日語聽解入門練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "07",
                "Desc": "生活科技"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-雅美語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語聽解入門練習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-雅美語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語聽解入門練習"
            }
        ],
        "2J": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "G2",
                "Desc": "日語聽解初階練習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-卑南語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-卑南語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-卑南語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語聽解初階練習"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-卑南語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-卑南語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "原住民族語文-卑南語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-卑南語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0I",
                "Desc": "原住民族語文-卑南語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語聽解初階練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "日語聽解初階練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "07",
                "Desc": "資訊科技"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "日語聽解初階練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "07",
                "Desc": "資訊科技"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-卑南語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語聽解初階練習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "原住民族語文-卑南語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語聽解初階練習"
            }
        ],
        "2K": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "G2",
                "Desc": "日語文型練習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語文型練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語文型練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "日語文型練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "08",
                "Desc": "健康與護理"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "日語文型練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "08",
                "Desc": "健康與護理"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語文型練習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語文型練習"
            }
        ],
        "2L": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "G2",
                "Desc": "日語翻譯練習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語翻譯練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語翻譯練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "日語翻譯練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "08",
                "Desc": "體育"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "日語翻譯練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "08",
                "Desc": "體育"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語翻譯練習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語翻譯練習"
            }
        ],
        "2M": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "G2",
                "Desc": "日語讀解入門練習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語讀解入門練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語讀解入門練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "日語讀解入門練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "09",
                "Desc": "全民國防教育"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "日語讀解入門練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "09",
                "Desc": "全民國防教育"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語讀解入門練習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語讀解入門練習"
            }
        ],
        "2N": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "G2",
                "Desc": "日語讀解初階練習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語讀解初階練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語讀解初階練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "日語讀解初階練習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "日語讀解初階練習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語讀解初階練習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日語讀解初階練習"
            }
        ],
        "2O": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "G2",
                "Desc": "日文商用書信實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日文商用書信實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日文商用書信實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "日文商用書信實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "日文商用書信實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日文商用書信實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "日文商用書信實務"
            }
        ],
        "2P": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "G3",
                "Desc": "外語簡報實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "外語簡報實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "外語簡報實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "外語簡報實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "外語簡報實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "外語簡報實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "外語簡報實務"
            }
        ],
        "2Q": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "G3",
                "Desc": "外語文書處理實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "外語文書處理實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "外語文書處理實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "外語文書處理實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "外語文書處理實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "外語文書處理實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "外語文書處理實務"
            }
        ],
        "2X": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "H1",
                "Desc": "圖文編排實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "圖文編排實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "圖文編排實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "圖文編排實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "圖文編排實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "圖文編排實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "圖文編排實習"
            }
        ],
        "2Y": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "H1",
                "Desc": "基礎攝影實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎攝影實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎攝影實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "基礎攝影實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "基礎攝影實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎攝影實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎攝影實習"
            }
        ],
        "2Z": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "H1",
                "Desc": "印刷與設計實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "印刷與設計實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "印刷與設計實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "印刷與設計實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "印刷與設計實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "印刷與設計實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "印刷與設計實務"
            }
        ],
        "30": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "H2",
                "Desc": "立體造形設計實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "立體造形設計實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "立體造形設計實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "立體造形設計實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "立體造形設計實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "立體造形設計實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "立體造形設計實習"
            }
        ],
        "31": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "H2",
                "Desc": "立體造形實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "日語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "日語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "日語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "立體造形實作"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "日語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "日語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "日語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "日語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "日語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "立體造形實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "立體造形實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "0H",
                "Desc": "日語"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "立體造形實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "0H",
                "Desc": "日語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "日語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "日語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "日語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "立體造形實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "日語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "日語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "日語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "立體造形實作"
            }
        ],
        "32": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "H3",
                "Desc": "電腦輔助設計實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "法語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "法語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "法語"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "法語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "法語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "法語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "法語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "法語"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "0H",
                "Desc": "法語"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "0H",
                "Desc": "法語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "法語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "法語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "法語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "法語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "法語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "法語"
            }
        ],
        "33": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "H3",
                "Desc": "數位成型實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "德語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "德語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "德語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位成型實務"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "德語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "德語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "德語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "德語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "德語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位成型實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "數位成型實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "0H",
                "Desc": "德語"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "數位成型實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "0H",
                "Desc": "德語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "德語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "德語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "德語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位成型實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "德語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "德語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "德語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位成型實務"
            }
        ],
        "34": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "H4",
                "Desc": "數位與商業攝影實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "西班牙語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "西班牙語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "西班牙語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位與商業攝影實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "西班牙語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "西班牙語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "西班牙語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "西班牙語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "西班牙語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位與商業攝影實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "數位與商業攝影實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "0H",
                "Desc": "西班牙語"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "數位與商業攝影實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "0H",
                "Desc": "西班牙語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "西班牙語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "西班牙語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "西班牙語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位與商業攝影實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "西班牙語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "西班牙語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "西班牙語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位與商業攝影實習"
            }
        ],
        "35": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "H4",
                "Desc": "影音製作實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "越南語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "越南語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "越南語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "影音製作實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "越南語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "越南語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "越南語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "越南語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "越南語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "影音製作實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "影音製作實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "0H",
                "Desc": "越南語"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "影音製作實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "0H",
                "Desc": "越南語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "越南語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "越南語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "越南語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "影音製作實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "越南語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "越南語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "越南語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "影音製作實習"
            }
        ],
        "36": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "H4",
                "Desc": "影音剪輯實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "印尼語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "印尼語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "印尼語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "影音剪輯實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "印尼語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "印尼語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "印尼語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "印尼語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "印尼語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "影音剪輯實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "影音剪輯實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "0H",
                "Desc": "印尼語"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "影音剪輯實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "0H",
                "Desc": "印尼語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "印尼語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "印尼語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "印尼語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "影音剪輯實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "印尼語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "印尼語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "印尼語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "影音剪輯實習"
            }
        ],
        "37": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "H5",
                "Desc": "網頁設計實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "泰國語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "泰國語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "泰國語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "網頁設計實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "泰國語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "泰國語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "泰國語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "泰國語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "泰國語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "網頁設計實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "網頁設計實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "0H",
                "Desc": "泰國語"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "網頁設計實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "0H",
                "Desc": "泰國語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "泰國語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "泰國語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "泰國語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "網頁設計實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "泰國語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "泰國語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "泰國語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "網頁設計實習"
            }
        ],
        "38": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "H5",
                "Desc": "動畫製作實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "緬甸語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "緬甸語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "緬甸語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動畫製作實習"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "緬甸語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "緬甸語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "緬甸語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "緬甸語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "緬甸語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動畫製作實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "動畫製作實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "0H",
                "Desc": "緬甸語"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "動畫製作實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "0H",
                "Desc": "緬甸語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "緬甸語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "緬甸語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "緬甸語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動畫製作實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "緬甸語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "緬甸語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "緬甸語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動畫製作實習"
            }
        ],
        "39": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "H6",
                "Desc": "室內設計與製圖實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "柬埔寨語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "柬埔寨語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "柬埔寨語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "室內設計與製圖實作"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "柬埔寨語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "柬埔寨語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "柬埔寨語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "柬埔寨語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "柬埔寨語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "室內設計與製圖實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "室內設計與製圖實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "0H",
                "Desc": "柬埔寨語"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "室內設計與製圖實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "0H",
                "Desc": "柬埔寨語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "柬埔寨語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "柬埔寨語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "柬埔寨語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "室內設計與製圖實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "柬埔寨語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "柬埔寨語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "柬埔寨語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "室內設計與製圖實作"
            }
        ],
        "3A": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "H6",
                "Desc": "室內裝修實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "菲律賓語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "菲律賓語"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "菲律賓語"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "室內裝修實務"
            },
            {
                "課程類別": "3",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "菲律賓語"
            },
            {
                "課程類別": "5",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "菲律賓語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "菲律賓語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "菲律賓語"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "菲律賓語"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "室內裝修實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "室內裝修實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "0H",
                "Desc": "菲律賓語"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "室內裝修實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "0H",
                "Desc": "菲律賓語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "菲律賓語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "菲律賓語"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "菲律賓語"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "室內裝修實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "菲律賓語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "菲律賓語"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "0H",
                "Desc": "菲律賓語"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "室內裝修實務"
            }
        ],
        "3F": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "I1",
                "Desc": "植物栽培實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "植物栽培實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "植物栽培實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "植物栽培實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "植物栽培實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "植物栽培實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "植物栽培實習"
            }
        ],
        "3G": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "I1",
                "Desc": "農業資源應用實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農業資源應用實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農業資源應用實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "農業資源應用實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "農業資源應用實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農業資源應用實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農業資源應用實習"
            }
        ],
        "3H": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "I1",
                "Desc": "植物識別實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "植物識別實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "植物識別實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "植物識別實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "植物識別實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "植物識別實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "植物識別實習"
            }
        ],
        "3I": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "I1",
                "Desc": "植物保護實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "植物保護實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "植物保護實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "植物保護實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "植物保護實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "植物保護實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "植物保護實習"
            }
        ],
        "3J": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "I2",
                "Desc": "解剖生理實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "解剖生理實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "解剖生理實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "解剖生理實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "解剖生理實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "解剖生理實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "解剖生理實習"
            }
        ],
        "3K": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "I2",
                "Desc": "動物飼養實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動物飼養實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動物飼養實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "動物飼養實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "動物飼養實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動物飼養實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動物飼養實習"
            }
        ],
        "3L": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "I2",
                "Desc": "動物保健實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動物保健實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動物保健實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "動物保健實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "動物保健實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動物保健實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動物保健實習"
            }
        ],
        "3M": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "I2",
                "Desc": "動物營養實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動物營養實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動物營養實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "動物營養實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "動物營養實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動物營養實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動物營養實習"
            }
        ],
        "3Q": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "J1",
                "Desc": "烘焙食品加工實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "烘焙食品加工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "烘焙食品加工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "烘焙食品加工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "烘焙食品加工實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "烘焙食品加工實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "烘焙食品加工實習"
            }
        ],
        "3R": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "J1",
                "Desc": "進階食品加工實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "進階食品加工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "進階食品加工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "進階食品加工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "進階食品加工實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "進階食品加工實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "進階食品加工實習"
            }
        ],
        "3S": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "J2",
                "Desc": "分析化學實習"
            }
        ],
        "3T": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "J2",
                "Desc": "食品檢驗分析實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食品檢驗分析實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食品檢驗分析實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "食品檢驗分析實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "食品檢驗分析實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食品檢驗分析實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食品檢驗分析實習"
            }
        ],
        "3U": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "J2",
                "Desc": "生物技術實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "生物技術實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "生物技術實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "生物技術實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "生物技術實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "生物技術實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "生物技術實習"
            }
        ],
        "3X": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "K1",
                "Desc": "美容美體實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "美容美體實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "美容美體實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "美容美體實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "美容美體實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "美容美體實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "美容美體實務"
            }
        ],
        "3Y": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "K1",
                "Desc": "美髮造型實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "美髮造型實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "美髮造型實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "美髮造型實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "美髮造型實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "美髮造型實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "美髮造型實務"
            }
        ],
        "3Z": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "K1",
                "Desc": "舞台表演實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "舞台表演實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "舞台表演實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "舞台表演實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "舞台表演實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "舞台表演實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "舞台表演實務"
            }
        ],
        "40": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "K1",
                "Desc": "整體造型設計與實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "整體造型設計與實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "整體造型設計與實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "整體造型設計與實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "整體造型設計與實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "整體造型設計與實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "整體造型設計與實務"
            }
        ],
        "41": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "K2",
                "Desc": "服裝製作實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "國學常識"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "國學常識"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "服裝製作實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "國學常識"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "國學常識"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "服裝製作實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "服裝製作實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "服裝製作實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "國學常識"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "國學常識"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "服裝製作實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "國學常識"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "國學常識"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "服裝製作實務"
            }
        ],
        "42": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "K2",
                "Desc": "服裝畫實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "語文表達與傳播應用"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "語文表達與傳播應用"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "服裝畫實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "語文表達與傳播應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "語文表達與傳播應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "服裝畫實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "服裝畫實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "服裝畫實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "語文表達與傳播應用"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "語文表達與傳播應用"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "服裝畫實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "語文表達與傳播應用"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "語文表達與傳播應用"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "服裝畫實務"
            }
        ],
        "43": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "K2",
                "Desc": "立體裁剪實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "各類文學選讀"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "各類文學選讀"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "立體裁剪實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "各類文學選讀"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "各類文學選讀"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "立體裁剪實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "立體裁剪實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "立體裁剪實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "各類文學選讀"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "各類文學選讀"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "立體裁剪實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "各類文學選讀"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "各類文學選讀"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "立體裁剪實務"
            }
        ],
        "44": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "K2",
                "Desc": "服裝設計實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "專題閱讀與研究"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "專題閱讀與研究"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "服裝設計實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "專題閱讀與研究"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "專題閱讀與研究"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "服裝設計實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "服裝設計實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "服裝設計實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "專題閱讀與研究"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "專題閱讀與研究"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "服裝設計實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "專題閱讀與研究"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "專題閱讀與研究"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "服裝設計實務"
            }
        ],
        "45": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "K3",
                "Desc": "嬰幼兒發展照護實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "英語聽講"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "英語聽講"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "嬰幼兒發展照護實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "英語聽講"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "英語聽講"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "嬰幼兒發展照護實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "嬰幼兒發展照護實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "嬰幼兒發展照護實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "英語聽講"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "英語聽講"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "嬰幼兒發展照護實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "英語聽講"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "英語聽講"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "嬰幼兒發展照護實務"
            }
        ],
        "46": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "K3",
                "Desc": "膳食與營養實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "英文閱讀與寫作"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "英文閱讀與寫作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "膳食與營養實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "英文閱讀與寫作"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "英文閱讀與寫作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "膳食與營養實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "膳食與營養實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "膳食與營養實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "英文閱讀與寫作"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "英文閱讀與寫作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "膳食與營養實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "英文閱讀與寫作"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "英文閱讀與寫作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "膳食與營養實務"
            }
        ],
        "47": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "K3",
                "Desc": "幼兒教保活動設計與實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "英文作文"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "英文作文"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "幼兒教保活動設計與實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "英文作文"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "英文作文"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "幼兒教保活動設計與實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "幼兒教保活動設計與實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "幼兒教保活動設計與實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "英文作文"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "英文作文"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "幼兒教保活動設計與實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "英文作文"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "01",
                "Desc": "英文作文"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "幼兒教保活動設計與實務"
            }
        ],
        "48": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "K3",
                "Desc": "家庭生活管理實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "數學甲"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學甲"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "家庭生活管理實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "數學甲"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學甲"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "家庭生活管理實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "家庭生活管理實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "家庭生活管理實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "數學甲"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學甲"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "家庭生活管理實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "數學甲"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "02",
                "Desc": "數學甲"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "家庭生活管理實務"
            }
        ],
        "4B": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "L1",
                "Desc": "中餐烹調實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "科技、環境與藝術的歷史"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "科技、環境與藝術的歷史"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "中餐烹調實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "科技、環境與藝術的歷史"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "科技、環境與藝術的歷史"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "中餐烹調實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "中餐烹調實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "中餐烹調實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "科技、環境與藝術的歷史"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "科技、環境與藝術的歷史"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "中餐烹調實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "科技、環境與藝術的歷史"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "科技、環境與藝術的歷史"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "中餐烹調實習"
            }
        ],
        "4C": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "L1",
                "Desc": "西餐烹調實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "空間資訊科技"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "空間資訊科技"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "西餐烹調實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "空間資訊科技"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "空間資訊科技"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "西餐烹調實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "西餐烹調實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "西餐烹調實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "空間資訊科技"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "空間資訊科技"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "西餐烹調實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "空間資訊科技"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "空間資訊科技"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "西餐烹調實習"
            }
        ],
        "4D": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "L2",
                "Desc": "烘焙實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "社會環境議題"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "社會環境議題"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "烘焙實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "社會環境議題"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "社會環境議題"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "烘焙實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "烘焙實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "烘焙實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "社會環境議題"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "社會環境議題"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "烘焙實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "社會環境議題"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "社會環境議題"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "烘焙實務"
            }
        ],
        "4E": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "L3",
                "Desc": "房務實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "現代社會與經濟"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "現代社會與經濟"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "房務實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "現代社會與經濟"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "現代社會與經濟"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "房務實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "房務實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "房務實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "現代社會與經濟"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "現代社會與經濟"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "房務實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "現代社會與經濟"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "現代社會與經濟"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "房務實務"
            }
        ],
        "4F": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "L3",
                "Desc": "旅館客務實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "民主政治與法律"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "民主政治與法律"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "旅館客務實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "民主政治與法律"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "民主政治與法律"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "旅館客務實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "旅館客務實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "旅館客務實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "民主政治與法律"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "民主政治與法律"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "旅館客務實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "民主政治與法律"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "民主政治與法律"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "旅館客務實務"
            }
        ],
        "4G": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "L4",
                "Desc": "旅遊實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "探究與實作：歷史學探究"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "探究與實作：歷史學探究"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "旅遊實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "探究與實作：歷史學探究"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "探究與實作：歷史學探究"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "旅遊實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "旅遊實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "旅遊實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "探究與實作：歷史學探究"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "探究與實作：歷史學探究"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "旅遊實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "探究與實作：歷史學探究"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "探究與實作：歷史學探究"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "旅遊實務"
            }
        ],
        "4H": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "L4",
                "Desc": "導覽解說實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "探究與實作：地理與人文社會科學研究"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "探究與實作：地理與人文社會科學研究"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "導覽解說實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "探究與實作：地理與人文社會科學研究"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "探究與實作：地理與人文社會科學研究"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "導覽解說實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "導覽解說實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "導覽解說實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "探究與實作：地理與人文社會科學研究"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "探究與實作：地理與人文社會科學研究"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "導覽解說實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "探究與實作：地理與人文社會科學研究"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "探究與實作：地理與人文社會科學研究"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "導覽解說實務"
            }
        ],
        "4I": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "L4",
                "Desc": "遊程規劃實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "探究與實作：公共議題與社會探究"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "探究與實作：公共議題與社會探究"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "遊程規劃實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "探究與實作：公共議題與社會探究"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "探究與實作：公共議題與社會探究"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "遊程規劃實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "遊程規劃實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "遊程規劃實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "探究與實作：公共議題與社會探究"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "探究與實作：公共議題與社會探究"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "遊程規劃實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "探究與實作：公共議題與社會探究"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "03",
                "Desc": "探究與實作：公共議題與社會探究"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "遊程規劃實務"
            }
        ],
        "4K": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "M1",
                "Desc": "航海與實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修物理-力學二與熱學"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-力學二與熱學"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "航海與實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修物理-力學二與熱學"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-力學二與熱學"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "航海與實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "航海與實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "航海與實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修物理-力學二與熱學"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-力學二與熱學"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "航海與實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修物理-力學二與熱學"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-力學二與熱學"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "航海與實習"
            }
        ],
        "4L": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "M1",
                "Desc": "海圖作業實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修物理-波動、光及聲音"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-波動、光及聲音"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "海圖作業實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修物理-波動、光及聲音"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-波動、光及聲音"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "海圖作業實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "海圖作業實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "海圖作業實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修物理-波動、光及聲音"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-波動、光及聲音"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "海圖作業實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修物理-波動、光及聲音"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-波動、光及聲音"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "海圖作業實務"
            }
        ],
        "4M": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "M2",
                "Desc": "漁具漁法與實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修物理-電磁現象一"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-電磁現象一"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "漁具漁法與實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修物理-電磁現象一"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-電磁現象一"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "漁具漁法與實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "漁具漁法與實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "漁具漁法與實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修物理-電磁現象一"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-電磁現象一"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "漁具漁法與實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修物理-電磁現象一"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-電磁現象一"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "漁具漁法與實習"
            }
        ],
        "4N": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "M2",
                "Desc": "航海儀器實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修物理-電磁現象二與量子現象"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-電磁現象二與量子現象"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "航海儀器實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修物理-電磁現象二與量子現象"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-電磁現象二與量子現象"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "航海儀器實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "航海儀器實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "航海儀器實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修物理-電磁現象二與量子現象"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-電磁現象二與量子現象"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "航海儀器實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修物理-電磁現象二與量子現象"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修物理-電磁現象二與量子現象"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "航海儀器實習"
            }
        ],
        "4O": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "M3",
                "Desc": "專業海上安全實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修化學-物質與能量"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-物質與能量"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "專業海上安全實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修化學-物質與能量"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-物質與能量"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "專業海上安全實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "專業海上安全實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "專業海上安全實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修化學-物質與能量"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-物質與能量"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "專業海上安全實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修化學-物質與能量"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-物質與能量"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "專業海上安全實務"
            }
        ],
        "4P": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "M3",
                "Desc": "潛水實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修化學-物質構造與反應速率"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-物質構造與反應速率"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "潛水實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修化學-物質構造與反應速率"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-物質構造與反應速率"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "潛水實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "潛水實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "潛水實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修化學-物質構造與反應速率"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-物質構造與反應速率"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "潛水實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修化學-物質構造與反應速率"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-物質構造與反應速率"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "潛水實習"
            }
        ],
        "4Q": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "M4",
                "Desc": "水質學實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修化學-化學反應與平衡一"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-化學反應與平衡一"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水質學實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修化學-化學反應與平衡一"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-化學反應與平衡一"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水質學實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "水質學實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "水質學實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修化學-化學反應與平衡一"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-化學反應與平衡一"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水質學實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修化學-化學反應與平衡一"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-化學反應與平衡一"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水質學實習"
            }
        ],
        "4R": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "M4",
                "Desc": "觀賞水族養殖實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修化學-化學反應與平衡二"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-化學反應與平衡二"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "觀賞水族養殖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修化學-化學反應與平衡二"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-化學反應與平衡二"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "觀賞水族養殖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "觀賞水族養殖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "觀賞水族養殖實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修化學-化學反應與平衡二"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-化學反應與平衡二"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "觀賞水族養殖實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修化學-化學反應與平衡二"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-化學反應與平衡二"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "觀賞水族養殖實習"
            }
        ],
        "4S": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "M5",
                "Desc": "餌料生物實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修化學-有機化學與應用科技"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-有機化學與應用科技"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "餌料生物實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修化學-有機化學與應用科技"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-有機化學與應用科技"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "餌料生物實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "餌料生物實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "餌料生物實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修化學-有機化學與應用科技"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-有機化學與應用科技"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "餌料生物實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修化學-有機化學與應用科技"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修化學-有機化學與應用科技"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "餌料生物實習"
            }
        ],
        "4T": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "M5",
                "Desc": "經濟性魚蝦養殖實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修生物-細胞與遺傳"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修生物-細胞與遺傳"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "經濟性魚蝦養殖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修生物-細胞與遺傳"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修生物-細胞與遺傳"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "經濟性魚蝦養殖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "經濟性魚蝦養殖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "經濟性魚蝦養殖實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修生物-細胞與遺傳"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修生物-細胞與遺傳"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "經濟性魚蝦養殖實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修生物-細胞與遺傳"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修生物-細胞與遺傳"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "經濟性魚蝦養殖實習"
            }
        ],
        "4U": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "M6",
                "Desc": "區域特色水族養殖實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修生物-動物體的構造與功能"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修生物-動物體的構造與功能"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "區域特色水族養殖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修生物-動物體的構造與功能"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修生物-動物體的構造與功能"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "區域特色水族養殖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "區域特色水族養殖實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "區域特色水族養殖實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修生物-動物體的構造與功能"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修生物-動物體的構造與功能"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "區域特色水族養殖實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修生物-動物體的構造與功能"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修生物-動物體的構造與功能"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "區域特色水族養殖實習"
            }
        ],
        "4V": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "M6",
                "Desc": "水族營養飼料學與實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修生物-生命的起源與植物體的構造與功能"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修生物-生命的起源與植物體的構造與功能"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水族營養飼料學與實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修生物-生命的起源與植物體的構造與功能"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修生物-生命的起源與植物體的構造與功能"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水族營養飼料學與實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "水族營養飼料學與實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "水族營養飼料學與實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修生物-生命的起源與植物體的構造與功能"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修生物-生命的起源與植物體的構造與功能"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水族營養飼料學與實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修生物-生命的起源與植物體的構造與功能"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修生物-生命的起源與植物體的構造與功能"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水族營養飼料學與實習"
            }
        ],
        "4W": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "M6",
                "Desc": "水產增殖專業實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修生物-生態、演化及生物多樣性"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修生物-生態、演化及生物多樣性"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水產增殖專業實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修生物-生態、演化及生物多樣性"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修生物-生態、演化及生物多樣性"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水產增殖專業實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "水產增殖專業實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "水產增殖專業實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修生物-生態、演化及生物多樣性"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修生物-生態、演化及生物多樣性"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水產增殖專業實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修生物-生態、演化及生物多樣性"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修生物-生態、演化及生物多樣性"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水產增殖專業實務"
            }
        ],
        "4X": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "M7",
                "Desc": "基礎海上安全實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修地球科學-地質與環境"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修地球科學-地質與環境"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎海上安全實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修地球科學-地質與環境"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修地球科學-地質與環境"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎海上安全實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "基礎海上安全實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "基礎海上安全實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修地球科學-地質與環境"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修地球科學-地質與環境"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎海上安全實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修地球科學-地質與環境"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修地球科學-地質與環境"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎海上安全實務"
            }
        ],
        "4Y": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "M7",
                "Desc": "水產增殖基礎實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修地球科學-大氣、海洋及天文"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修地球科學-大氣、海洋及天文"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水產增殖基礎實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修地球科學-大氣、海洋及天文"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修地球科學-大氣、海洋及天文"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水產增殖基礎實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "水產增殖基礎實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "水產增殖基礎實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修地球科學-大氣、海洋及天文"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修地球科學-大氣、海洋及天文"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水產增殖基礎實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "選修地球科學-大氣、海洋及天文"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "選修地球科學-大氣、海洋及天文"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "水產增殖基礎實務"
            }
        ],
        "51": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "N1",
                "Desc": "船舶金工實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "多媒體音樂"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "多媒體音樂"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船舶金工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "多媒體音樂"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "多媒體音樂"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船舶金工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "船舶金工實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "船舶金工實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "多媒體音樂"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "多媒體音樂"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船舶金工實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "多媒體音樂"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "多媒體音樂"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船舶金工實習"
            }
        ],
        "52": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "N1",
                "Desc": "船舶銲接實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "新媒體藝術"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "新媒體藝術"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船舶銲接實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "新媒體藝術"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "新媒體藝術"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船舶銲接實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "船舶銲接實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "船舶銲接實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "新媒體藝術"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "新媒體藝術"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船舶銲接實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "新媒體藝術"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "05",
                "Desc": "新媒體藝術"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船舶銲接實習"
            }
        ],
        "53": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "N2",
                "Desc": "船舶電器操作與保養實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "未來想像與生涯進路"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "未來想像與生涯進路"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船舶電器操作與保養實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "未來想像與生涯進路"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "未來想像與生涯進路"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船舶電器操作與保養實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "船舶電器操作與保養實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "船舶電器操作與保養實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "未來想像與生涯進路"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "未來想像與生涯進路"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船舶電器操作與保養實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "未來想像與生涯進路"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "未來想像與生涯進路"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船舶電器操作與保養實習"
            }
        ],
        "54": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "N2",
                "Desc": "機電整合實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "思考：智慧的啟航"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "思考：智慧的啟航"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "思考：智慧的啟航"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "思考：智慧的啟航"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "思考：智慧的啟航"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "思考：智慧的啟航"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "思考：智慧的啟航"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "思考：智慧的啟航"
            }
        ],
        "55": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "N3",
                "Desc": "動力設備操作實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "創新生活與家庭"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "創新生活與家庭"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動力設備操作實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "創新生活與家庭"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "創新生活與家庭"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動力設備操作實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "動力設備操作實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "動力設備操作實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "創新生活與家庭"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "創新生活與家庭"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動力設備操作實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "創新生活與家庭"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "06",
                "Desc": "創新生活與家庭"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動力設備操作實習"
            }
        ],
        "56": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "N3",
                "Desc": "動力設備拆裝實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "工程設計專題"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "工程設計專題"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動力設備拆裝實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "工程設計專題"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "工程設計專題"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動力設備拆裝實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "動力設備拆裝實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "動力設備拆裝實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "工程設計專題"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "工程設計專題"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動力設備拆裝實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "工程設計專題"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "工程設計專題"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "動力設備拆裝實習"
            }
        ],
        "57": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "N4",
                "Desc": "船藝實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "領域課程：科技應用專題"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "領域課程：科技應用專題"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船藝實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "領域課程：科技應用專題"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "領域課程：科技應用專題"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船藝實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "船藝實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "船藝實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "領域課程：科技應用專題"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "領域課程：科技應用專題"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船藝實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "領域課程：科技應用專題"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "領域課程：科技應用專題"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船藝實習"
            }
        ],
        "58": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "N4",
                "Desc": "海圖作業實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "進階程式設計"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "進階程式設計"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "海圖作業實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "進階程式設計"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "進階程式設計"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "海圖作業實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "海圖作業實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "海圖作業實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "進階程式設計"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "進階程式設計"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "海圖作業實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "進階程式設計"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "進階程式設計"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "海圖作業實習"
            }
        ],
        "59": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "N4",
                "Desc": "航海英文實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "領域課程：機器人專題"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "領域課程：機器人專題"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "航海英文實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "領域課程：機器人專題"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "領域課程：機器人專題"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "航海英文實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "航海英文實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "航海英文實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "領域課程：機器人專題"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "領域課程：機器人專題"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "航海英文實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "領域課程：機器人專題"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "07",
                "Desc": "領域課程：機器人專題"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "航海英文實務"
            }
        ],
        "5A": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "N5",
                "Desc": "航海實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "安全教育與傷害防護"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "安全教育與傷害防護"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "航海實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "安全教育與傷害防護"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "安全教育與傷害防護"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "航海實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "航海實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "航海實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "安全教育與傷害防護"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "安全教育與傷害防護"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "航海實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "安全教育與傷害防護"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "安全教育與傷害防護"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "航海實習"
            }
        ],
        "5B": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "N5",
                "Desc": "船舶通訊實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "運動與健康"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "運動與健康"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船舶通訊實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "運動與健康"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "運動與健康"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船舶通訊實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "船舶通訊實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "船舶通訊實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "運動與健康"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "運動與健康"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船舶通訊實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "運動與健康"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "運動與健康"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "船舶通訊實習"
            }
        ],
        "5C": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "N6",
                "Desc": "雷達與測繪實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "健康與休閒生活"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "健康與休閒生活"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "雷達與測繪實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "健康與休閒生活"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "健康與休閒生活"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "雷達與測繪實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "雷達與測繪實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "雷達與測繪實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "健康與休閒生活"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "健康與休閒生活"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "雷達與測繪實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "健康與休閒生活"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "08",
                "Desc": "健康與休閒生活"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "雷達與測繪實習"
            }
        ],
        "5D": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "N6",
                "Desc": "電子航儀實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "家庭教育"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電子航儀實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "家庭教育"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電子航儀實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "電子航儀實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "電子航儀實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "家庭教育"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電子航儀實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "家庭教育"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "電子航儀實習"
            }
        ],
        "5E": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "N7",
                "Desc": "基礎銲接實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "藝術與科技"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎銲接實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "藝術與科技"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎銲接實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "基礎銲接實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "基礎銲接實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "藝術與科技"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎銲接實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "藝術與科技"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎銲接實習"
            }
        ],
        "5F": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "N7",
                "Desc": "繩纜作業實習"
            },
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "商業概論"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "繩纜作業實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "商業概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "繩纜作業實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "繩纜作業實習"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "繩纜作業實習"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "商業概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "繩纜作業實習"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "商業概論"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "繩纜作業實習"
            }
        ],
        "5L": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "O1",
                "Desc": "繪畫基礎實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "繪畫基礎實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "繪畫基礎實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "繪畫基礎實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "繪畫基礎實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "繪畫基礎實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "繪畫基礎實務"
            }
        ],
        "5M": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "O1",
                "Desc": "素描實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "素描實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "素描實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "素描實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "素描實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "素描實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "素描實作"
            }
        ],
        "5N": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "O1",
                "Desc": "數位設計實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位設計實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位設計實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "數位設計實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "數位設計實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位設計實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位設計實務"
            }
        ],
        "5O": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "O1",
                "Desc": "版面編排實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "版面編排實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "版面編排實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "版面編排實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "版面編排實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "版面編排實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "版面編排實作"
            }
        ],
        "5P": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "O2",
                "Desc": "多媒材實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "多媒材實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "多媒材實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "多媒材實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "多媒材實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "多媒材實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "多媒材實務"
            }
        ],
        "5Q": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "O2",
                "Desc": "劇場技術基礎實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "劇場技術基礎實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "劇場技術基礎實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "劇場技術基礎實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "劇場技術基礎實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "劇場技術基礎實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "劇場技術基礎實作"
            }
        ],
        "5R": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "O3",
                "Desc": "數位攝錄影實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位攝錄影實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位攝錄影實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "數位攝錄影實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "數位攝錄影實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位攝錄影實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "數位攝錄影實務"
            }
        ],
        "5S": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "O3",
                "Desc": "影音後製實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "影音後製實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "影音後製實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "影音後製實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "影音後製實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "影音後製實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "影音後製實作"
            }
        ],
        "5T": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "O4",
                "Desc": "音樂基礎實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "音樂基礎實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "音樂基礎實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "音樂基礎實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "音樂基礎實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "音樂基礎實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "音樂基礎實務"
            }
        ],
        "5U": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "O4",
                "Desc": "音樂創作基礎實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "音樂創作基礎實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "音樂創作基礎實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "音樂創作基礎實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "音樂創作基礎實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "音樂創作基礎實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "音樂創作基礎實務"
            }
        ],
        "5V": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "O5",
                "Desc": "舞蹈基礎實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "舞蹈基礎實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "舞蹈基礎實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "舞蹈基礎實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "舞蹈基礎實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "舞蹈基礎實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "舞蹈基礎實務"
            }
        ],
        "5W": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "O5",
                "Desc": "舞蹈編排實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "舞蹈編排實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "舞蹈編排實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "舞蹈編排實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "舞蹈編排實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "舞蹈編排實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "舞蹈編排實作"
            }
        ],
        "5X": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "O6",
                "Desc": "表演基礎實務"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "表演基礎實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "表演基礎實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "表演基礎實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "表演基礎實務"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "表演基礎實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "表演基礎實務"
            }
        ],
        "5Y": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "O6",
                "Desc": "肢體與聲音創作實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "肢體與聲音創作實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "肢體與聲音創作實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "肢體與聲音創作實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "肢體與聲音創作實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "肢體與聲音創作實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "肢體與聲音創作實作"
            }
        ],
        "64": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U1",
                "Desc": "車輛外部清理實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車輛外部清理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車輛外部清理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "車輛外部清理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "車輛外部清理實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車輛外部清理實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車輛外部清理實作"
            }
        ],
        "65": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U1",
                "Desc": "車輛內裝清理實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車輛內裝清理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車輛內裝清理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "車輛內裝清理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "車輛內裝清理實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車輛內裝清理實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車輛內裝清理實作"
            }
        ],
        "66": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U1",
                "Desc": "車輛美容實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車輛美容實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車輛美容實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "車輛美容實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "車輛美容實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車輛美容實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "車輛美容實作"
            }
        ],
        "67": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U2",
                "Desc": "基礎設備實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎設備實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎設備實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "基礎設備實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "基礎設備實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎設備實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎設備實作"
            }
        ],
        "68": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U2",
                "Desc": "收銀台實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "收銀台實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "收銀台實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "收銀台實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "收銀台實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "收銀台實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "收銀台實作"
            }
        ],
        "69": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U2",
                "Desc": "門市作業實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "門市作業實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "門市作業實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "門市作業實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "門市作業實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "門市作業實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "門市作業實作"
            }
        ],
        "6A": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U3",
                "Desc": "物品整理實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "物品整理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "物品整理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "物品整理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "物品整理實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "物品整理實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "物品整理實作"
            }
        ],
        "6B": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U3",
                "Desc": "倉儲實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "倉儲實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "倉儲實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "倉儲實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "倉儲實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "倉儲實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "倉儲實作"
            }
        ],
        "6C": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U3",
                "Desc": "配送實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "配送實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "配送實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "配送實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "配送實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "配送實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "配送實作"
            }
        ],
        "6D": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U4",
                "Desc": "農園藝種植維護實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農園藝種植維護實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農園藝種植維護實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "農園藝種植維護實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "農園藝種植維護實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農園藝種植維護實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農園藝種植維護實作"
            }
        ],
        "6E": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U4",
                "Desc": "園藝景觀維護管理實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "園藝景觀維護管理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "園藝景觀維護管理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "園藝景觀維護管理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "園藝景觀維護管理實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "園藝景觀維護管理實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "園藝景觀維護管理實作"
            }
        ],
        "6F": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U4",
                "Desc": "農園管理維護實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農園管理維護實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農園管理維護實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "農園管理維護實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "農園管理維護實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農園管理維護實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "農園管理維護實作"
            }
        ],
        "6G": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U5",
                "Desc": "基礎蔬果加工實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎蔬果加工實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎蔬果加工實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "基礎蔬果加工實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "基礎蔬果加工實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎蔬果加工實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎蔬果加工實作"
            }
        ],
        "6H": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U5",
                "Desc": "基礎雜糧作物加工實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎雜糧作物加工實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎雜糧作物加工實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "基礎雜糧作物加工實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "基礎雜糧作物加工實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎雜糧作物加工實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎雜糧作物加工實作"
            }
        ],
        "6I": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U5",
                "Desc": "基礎香草加工實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎香草加工實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎香草加工實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "基礎香草加工實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "基礎香草加工實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎香草加工實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎香草加工實作"
            }
        ],
        "6J": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U6",
                "Desc": "組裝技能實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "組裝技能實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "組裝技能實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "組裝技能實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "組裝技能實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "組裝技能實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "組裝技能實作"
            }
        ],
        "6K": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U6",
                "Desc": "代工品組裝實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "代工品組裝實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "代工品組裝實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "代工品組裝實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "代工品組裝實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "代工品組裝實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "代工品組裝實作"
            }
        ],
        "6L": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U6",
                "Desc": "商品包裝實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "商品包裝實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "商品包裝實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "商品包裝實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "商品包裝實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "商品包裝實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "商品包裝實作"
            }
        ],
        "6M": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U7",
                "Desc": "生活保健實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "生活保健實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "生活保健實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "生活保健實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "生活保健實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "生活保健實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "生活保健實作"
            }
        ],
        "6N": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U7",
                "Desc": "居家照顧實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "居家照顧實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "居家照顧實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "居家照顧實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "居家照顧實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "居家照顧實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "居家照顧實作"
            }
        ],
        "6O": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U7",
                "Desc": "飲食調理實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "飲食調理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "飲食調理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "飲食調理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "飲食調理實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "飲食調理實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "飲食調理實作"
            }
        ],
        "6P": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U8",
                "Desc": "生活用品整理實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "生活用品整理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "生活用品整理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "生活用品整理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "生活用品整理實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "生活用品整理實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "生活用品整理實作"
            }
        ],
        "6Q": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U8",
                "Desc": "家電使用與維護實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "家電使用與維護實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "家電使用與維護實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "家電使用與維護實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "家電使用與維護實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "家電使用與維護實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "家電使用與維護實作"
            }
        ],
        "6R": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U8",
                "Desc": "家事處理實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "家事處理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "家事處理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "家事處理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "家事處理實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "家事處理實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "家事處理實作"
            }
        ],
        "6S": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U9",
                "Desc": "食材處理實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食材處理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食材處理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "食材處理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "食材處理實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食材處理實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "食材處理實作"
            }
        ],
        "6T": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U9",
                "Desc": "基礎速食實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎速食實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎速食實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "基礎速食實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "基礎速食實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎速食實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎速食實作"
            }
        ],
        "6U": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "U9",
                "Desc": "飲料調製實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "飲料調製實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "飲料調製實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "飲料調製實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "飲料調製實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "飲料調製實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "飲料調製實作"
            }
        ],
        "6V": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "UA",
                "Desc": "客房整理實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "客房整理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "客房整理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "客房整理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "客房整理實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "客房整理實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "客房整理實作"
            }
        ],
        "6W": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "UA",
                "Desc": "客房清潔與維護實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "客房清潔與維護實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "客房清潔與維護實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "客房清潔與維護實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "客房清潔與維護實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "客房清潔與維護實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "客房清潔與維護實作"
            }
        ],
        "6X": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "UA",
                "Desc": "客房服務實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "客房服務實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "客房服務實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "客房服務實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "客房服務實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "客房服務實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "客房服務實作"
            }
        ],
        "6Y": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "UB",
                "Desc": "按摩基礎手法實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "按摩基礎手法實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "按摩基礎手法實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "按摩基礎手法實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "按摩基礎手法實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "按摩基礎手法實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "按摩基礎手法實作"
            }
        ],
        "6Z": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "UB",
                "Desc": "局部按摩實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "局部按摩實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "局部按摩實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "局部按摩實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "局部按摩實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "局部按摩實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "局部按摩實作"
            }
        ],
        "70": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "UC",
                "Desc": "基礎精油物品實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎精油物品實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎精油物品實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "基礎精油物品實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "基礎精油物品實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎精油物品實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎精油物品實作"
            }
        ],
        "71": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "UC",
                "Desc": "基礎精油按摩手法實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎精油按摩手法實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎精油按摩手法實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "基礎精油按摩手法實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "基礎精油按摩手法實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎精油按摩手法實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "基礎精油按摩手法實作"
            }
        ],
        "72": [
            {
                "課程類別": "1",
                "科目屬性": "3",
                "領域名稱": "UC",
                "Desc": "足部精油按摩實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "足部精油按摩實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "足部精油按摩實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "足部精油按摩實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "足部精油按摩實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "足部精油按摩實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "足部精油按摩實作"
            }
        ],
        "73": [
            {
                "課程類別": "2",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "專題實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "專題實作"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "專題實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "專題實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "專題實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "專題實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "專題實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "專題實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "專題實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "專題實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "專題實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "專題實作"
            }
        ],
        "7E": [
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "職涯體驗"
            },
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "職涯體驗"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "職涯體驗"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "應用力學"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "應用力學"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "職涯體驗"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "職涯體驗"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "職涯體驗"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "職涯體驗"
            }
        ],
        "7F": [
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "表演基礎訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "表演基礎訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "引擎原理"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "引擎原理"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "表演基礎訓練"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "表演基礎訓練"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "表演基礎訓練"
            }
        ],
        "7G": [
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "戲曲身段基礎訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "戲曲身段基礎訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "底盤原理"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "底盤原理"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "戲曲身段基礎訓練"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "戲曲身段基礎訓練"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "戲曲身段基礎訓練"
            }
        ],
        "7H": [
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "音樂基礎訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "音樂基礎訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "基本電學"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "基本電學"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "音樂基礎訓練"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "音樂基礎訓練"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "音樂基礎訓練"
            }
        ],
        "7I": [
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "舞蹈基礎訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "舞蹈基礎訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "電子學"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "電子學"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "舞蹈基礎訓練"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "舞蹈基礎訓練"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "舞蹈基礎訓練"
            }
        ],
        "81": [
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "烘焙實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "烘焙實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "創意潛能開發"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "創意潛能開發"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "烘焙實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "烘焙實務"
            }
        ],
        "82": [
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "基礎設備實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "基礎設備實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "設計與生活美學"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "設計與生活美學"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "基礎設備實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "基礎設備實作"
            }
        ],
        "83": [
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "飲食調理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "飲食調理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "農業概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "農業概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "飲食調理實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "飲食調理實作"
            }
        ],
        "84": [
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "行銷實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "行銷實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "生物技術概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "生物技術概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "行銷實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "行銷實務"
            }
        ],
        "85": [
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "多媒體製作與應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "多媒體製作與應用"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "農業安全衛生"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "農業安全衛生"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "多媒體製作與應用"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "多媒體製作與應用"
            }
        ],
        "86": [
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "生活用品整理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "生活用品整理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "生命科學概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "生命科學概論"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "生活用品整理實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "生活用品整理實作"
            }
        ],
        "87": [
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "食材處理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "食材處理實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "食品加工"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "食品加工"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "食材處理實作"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "食材處理實作"
            }
        ],
        "88": [
            {
                "課程類別": "2",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "美髮實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "美髮實務"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "食品微生物"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "食品微生物"
            },
            {
                "課程類別": "D",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "美髮實務"
            },
            {
                "課程類別": "E",
                "科目屬性": "2",
                "領域名稱": "00",
                "Desc": "美髮實務"
            }
        ],
        "7J": [
            {
                "課程類別": "2",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "職前訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "職前訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "數位邏輯設計"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "數位邏輯設計"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "職前訓練"
            },
            {
                "課程類別": "E",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "職前訓練"
            }
        ],
        "74": [
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "00",
                "Desc": "自然科學探究與實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "1",
                "領域名稱": "04",
                "Desc": "自然科學探究與實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "競技運動綜合訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "自然科學探究與實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "04",
                "Desc": "自然科學探究與實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "自然科學探究與實作"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "04",
                "Desc": "自然科學探究與實作"
            },
            {
                "課程類別": "D",
                "科目屬性": "3",
                "領域名稱": "00",
                "Desc": "競技運動綜合訓練"
            }
        ],
        "7K": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "微處理機"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "微處理機"
            }
        ],
        "7L": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "電工機械"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "電工機械"
            }
        ],
        "7M": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "冷凍空調原理"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "冷凍空調原理"
            }
        ],
        "7N": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "普通化學"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "普通化學"
            }
        ],
        "7O": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "分析化學"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "分析化學"
            }
        ],
        "7P": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "基礎化工"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "基礎化工"
            }
        ],
        "7Q": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "化工裝置"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "化工裝置"
            }
        ],
        "7R": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "土木建築工程與技術概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "土木建築工程與技術概論"
            }
        ],
        "7S": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "構造與施工法"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "構造與施工法"
            }
        ],
        "7T": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "基礎工程力學"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "基礎工程力學"
            }
        ],
        "7U": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "商業概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "商業概論"
            }
        ],
        "7V": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "數位科技概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "數位科技概論"
            }
        ],
        "7W": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "會計學"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "會計學"
            }
        ],
        "7X": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "經濟學"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "經濟學"
            }
        ],
        "7Y": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "設計概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "設計概論"
            }
        ],
        "7Z": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "色彩原理"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "色彩原理"
            }
        ],
        "80": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "造形原理"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "造形原理"
            }
        ],
        "89": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "食品化學與分析"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "食品化學與分析"
            }
        ],
        "8A": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "家政概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "家政概論"
            }
        ],
        "8B": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "色彩概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "色彩概論"
            }
        ],
        "8C": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "家政職業衛生與安全"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "家政職業衛生與安全"
            }
        ],
        "8D": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "家庭教育"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "家庭教育"
            }
        ],
        "8E": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "家政職業倫理"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "家政職業倫理"
            }
        ],
        "8F": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "行銷與服務"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "行銷與服務"
            }
        ],
        "8G": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "家政美學"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "家政美學"
            }
        ],
        "8H": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "觀光餐旅業導論"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "觀光餐旅業導論"
            }
        ],
        "8I": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "觀光餐旅英語會話"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "觀光餐旅英語會話"
            }
        ],
        "8J": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "水產概要"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "水產概要"
            }
        ],
        "8K": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "船藝"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "船藝"
            }
        ],
        "8L": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "輪機"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "輪機"
            }
        ],
        "8M": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "海上安全法規概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "海上安全法規概論"
            }
        ],
        "8N": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "海運概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "海運概論"
            }
        ],
        "8O": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "藝術概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "藝術概論"
            }
        ],
        "8P": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "藝術欣賞"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "藝術欣賞"
            }
        ],
        "8Q": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "藝術與科技"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "藝術與科技"
            }
        ],
        "8R": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "服務導論"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "服務導論"
            }
        ],
        "8S": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "衛生與安全概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "衛生與安全概論"
            }
        ],
        "8T": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "事務機器與電腦應用概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "事務機器與電腦應用概論"
            }
        ],
        "8U": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "運動學概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "0S",
                "Desc": "運動學概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "運動學概論"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "0S",
                "Desc": "運動學概論"
            }
        ],
        "8V": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "專項體能訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "0T",
                "Desc": "專項體能訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "專項體能訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "0T",
                "Desc": "專項體能訓練"
            }
        ],
        "8W": [
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "00",
                "Desc": "專項技術訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "4",
                "領域名稱": "0T",
                "Desc": "專項技術訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "00",
                "Desc": "專項技術訓練"
            },
            {
                "課程類別": "7",
                "科目屬性": "5",
                "領域名稱": "0T",
                "Desc": "專項技術訓練"
            }
        ]
    }
}